# Pandas Programs

In [1]:
#import libraries
import pandas as pd

In [2]:
a=["Yaswanth","Abhishek","Shimlan"]
print(type(a))

<class 'list'>

In [3]:
a={"Name" : ["Yaswanth","Abhishek","Shimlan"]}
data=pd.DataFrame(a)
print(type(data))
print(data)

<class 'pandas.core.frame.DataFrame'>
       Name
0  Yaswanth
1  Abhishek
2   Shimlan

In [4]:
a={"Name" : ["Yaswanth","Abhishek","Shimlan"],
   "Age" : [22,23,23],
   "Sal" : [50000,60000,70000]}
data=pd.DataFrame(a)
print(type(data))
print(data)

<class 'pandas.core.frame.DataFrame'>
       Name  Age    Sal
0  Yaswanth   22  50000
1  Abhishek   23  60000
2   Shimlan   23  70000

# Program2

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/crops.csv")
print(df)

             crop     year   area     msp  yields
0            rice  2014-15  15759    1360  378216
1            rice  2015-16  15987    1414  383688
2            rice  2016-17  15747    1470  377928
3            rice  2017-18  15958    1550  382992
4            rice  2018-19  15848    1750  380352
..            ...      ...    ...     ...     ...
95  errachandanam  2014-15      5  150000      10
96  errachandanam  2015-16      5  160000      10
97  errachandanam  2016-17      9  190000      10
98  errachandanam  2017-18     10  195000      10
99  errachandanam  2018-19     12  209000      10

[100 rows x 5 columns]

In [3]:
#To print the entire DataFrame
print(df.to_string())

             crop     year   area     msp  yields
0            rice  2014-15  15759    1360  378216
1            rice  2015-16  15987    1414  383688
2            rice  2016-17  15747    1470  377928
3            rice  2017-18  15958    1550  382992
4            rice  2018-19  15848    1750  380352
5           maize  2014-15   1199    1310   29975
6           maize  2015-16   1227    1325   30675
7           maize  2016-17   1325    1365   33125
8           maize  2017-18   1369    1425   34225
9           maize  2018-19    951    1700   23775
10      greengram  2014-15     45    4600     225
11      greengram  2015-16     40    4850     200
12      greengram  2016-17     51    5225     255
13      greengram  2017-18     40    5575     200
14      greengram  2018-19     38    6975     190
15        redgram  2014-15     27    3175     168
16       red gram  2015-16     12    3500      72
17       red gram  2016-17     16    4000      80
18       red gram  2017-18     33    4400     165
19       red gram  2018-19     30    4600     150
20         cotton  2014-15    183    3750    1098
21         cotton  2015-16    176    3800    1056
22         cotton  2016-17    135    3860     810
23         cotton  2017-18    157    4020     942
24         cotton  2018-19     79    5150     474
25       turmeric  2014-15      3       2      30
26       turmeric  2015-16      7       2      70
27       turmeric  2016-17      2       2      20
28       turmeric  2017-18      3       2      30
29       turmeric  2018-19      6       2      60
30      sugarcane  2014-15   2627     220  525400
31      sugarcane  2015-16   1863     230  372600
32      sugarcane  2016-17   1711     230  342200
33      sugarcane  2017-18   1448     255  289600
34      sugarcane  2018-19   1266     275  253200
35          mango  2014-15   3408   10000   51015
36          mango  2015-16   2527   10100   37905
37          mango  2016-17   2092   11000   31380
38          mango  2017-18   1829   11500   87435
39          mango  2018-19   1627   13000   24405
40     cashew nut  2014-15    284   10000     568
41     cashew nut  2015-16    254   11000     508
42     cashew nut  2016-17    223   12000     446
43     cashew nut  2017-18    226   13000     452
44     cashew nut  2018-19    189   19000     378
45         banana  2014-15    116    6000   18560
46         banana  2015-16    235    7000   43600
47         banana  2016-17     76    9000   12160
48         banana  2017-18     70   10000   11200
49         banana  2018-19     36   15000    5760
50          guava  2014-15    176    9000    1760
51          guava  2015-16    242    9500    2420
52          guava  2016-17    302    9600    3020
53          guava  2017-18    345    9700    3450
54          guava  2018-19    363   10000    3630
55          lemon  2014-15     49   15000     245
56          lemon  2015-16     54   15500     270
57          lemon  2016-17     67   16000     335
58          lemon  2017-18     95   17000     475
59          lemon  2018-19     95   17500     475
60        coconut  2014-15    188    1450   56400
61        coconut  2015-16    169    1500   50700
62        coconut  2016-17    137    1600   41100
63        coconut  2017-18    152    1760   45600
64        coconut  2018-19    155    2030   46100
65         sapota  2014-15     21    6000     840
66         sapota  2015-16     79    5000    3160
67         sapota  2016-17     68    5500    2720
68         sapota  2017-18     74    6200    2960
69         sapota  2018-19     70    6500    2800
70        palmoil  2014-15   1487   30000  386620
71        palmoil  2015-16   1792   35000  465920
72        palmoil  2016-17   1866   36000  485160
73        palmoil  2017-18   1915   38000  497900
74        palmoil  2018-19   1955   40000  508300
75      eukalptus  2014-15   2003    8000  460690
76      eukalptus  2015-16   2548    8500  586040
77      eukalytus  2016-17   2585    9000  594550
78      eukalytus  2017-18   2664    9500  612720
79      eukalytus  2018-19   2668   10000  613640
80        malbari  2014-15      5   90000    2250
81        malbari  2015-16      5   80000    2850
82        malbari  2016-17     19   60000    8550
83        malbari  2017-18     17   85000    7650
84        malbari  2018-19     19   90000    8559
85     chedu vepa  2014-15     15   56000    3750
86     chedu vepa  2015-16     15   59000    3750
87     chedu vepa  2016-17     15   65000    3750
88     chedu vepa  2017-18     19   67000    4750
89     chedu vepa  2018-19     19   75000    4750
90          tekku  2014-15     25  150000      10
91          tekku  2015-16     32  160000      10
92          tekku  2016-17     34  175000      10
93          tekku  2017-18     40  189000      10
94          tekku  2018-19     40  190000      10
95  errachandanam  2014-15      5  150000      10
96  errachandanam  2015-16      5  160000      10
97  errachandanam  2016-17      9  190000      10
98  errachandanam  2017-18     10  195000      10
99  errachandanam  2018-19     12  209000      10

In [4]:
df=pd.read_csv("Data/iris.data")
print(df)

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [5]:
df=pd.read_csv("Data/iris.data", names=["Feature 1","Feature 2","Feature 3","Feature 4","Result"])
print(df)

     Feature 1  Feature 2  Feature 3  Feature 4          Result
0          5.1        3.5        1.4        0.2     Iris-setosa
1          4.9        3.0        1.4        0.2     Iris-setosa
2          4.7        3.2        1.3        0.2     Iris-setosa
3          4.6        3.1        1.5        0.2     Iris-setosa
4          5.0        3.6        1.4        0.2     Iris-setosa
..         ...        ...        ...        ...             ...
145        6.7        3.0        5.2        2.3  Iris-virginica
146        6.3        2.5        5.0        1.9  Iris-virginica
147        6.5        3.0        5.2        2.0  Iris-virginica
148        6.2        3.4        5.4        2.3  Iris-virginica
149        5.9        3.0        5.1        1.8  Iris-virginica

[150 rows x 5 columns]

In [6]:
df=pd.read_csv("Data/iris.data", names=["Feature 1","Feature 2","Feature 3","Feature 4","Result"])
print(df.to_string())

     Feature 1  Feature 2  Feature 3  Feature 4           Result
0          5.1        3.5        1.4        0.2      Iris-setosa
1          4.9        3.0        1.4        0.2      Iris-setosa
2          4.7        3.2        1.3        0.2      Iris-setosa
3          4.6        3.1        1.5        0.2      Iris-setosa
4          5.0        3.6        1.4        0.2      Iris-setosa
5          5.4        3.9        1.7        0.4      Iris-setosa
6          4.6        3.4        1.4        0.3      Iris-setosa
7          5.0        3.4        1.5        0.2      Iris-setosa
8          4.4        2.9        1.4        0.2      Iris-setosa
9          4.9        3.1        1.5        0.1      Iris-setosa
10         5.4        3.7        1.5        0.2      Iris-setosa
11         4.8        3.4        1.6        0.2      Iris-setosa
12         4.8        3.0        1.4        0.1      Iris-setosa
13         4.3        3.0        1.1        0.1      Iris-setosa
14         5.8        4.0        1.2        0.2      Iris-setosa
15         5.7        4.4        1.5        0.4      Iris-setosa
16         5.4        3.9        1.3        0.4      Iris-setosa
17         5.1        3.5        1.4        0.3      Iris-setosa
18         5.7        3.8        1.7        0.3      Iris-setosa
19         5.1        3.8        1.5        0.3      Iris-setosa
20         5.4        3.4        1.7        0.2      Iris-setosa
21         5.1        3.7        1.5        0.4      Iris-setosa
22         4.6        3.6        1.0        0.2      Iris-setosa
23         5.1        3.3        1.7        0.5      Iris-setosa
24         4.8        3.4        1.9        0.2      Iris-setosa
25         5.0        3.0        1.6        0.2      Iris-setosa
26         5.0        3.4        1.6        0.4      Iris-setosa
27         5.2        3.5        1.5        0.2      Iris-setosa
28         5.2        3.4        1.4        0.2      Iris-setosa
29         4.7        3.2        1.6        0.2      Iris-setosa
30         4.8        3.1        1.6        0.2      Iris-setosa
31         5.4        3.4        1.5        0.4      Iris-setosa
32         5.2        4.1        1.5        0.1      Iris-setosa
33         5.5        4.2        1.4        0.2      Iris-setosa
34         4.9        3.1        1.5        0.1      Iris-setosa
35         5.0        3.2        1.2        0.2      Iris-setosa
36         5.5        3.5        1.3        0.2      Iris-setosa
37         4.9        3.1        1.5        0.1      Iris-setosa
38         4.4        3.0        1.3        0.2      Iris-setosa
39         5.1        3.4        1.5        0.2      Iris-setosa
40         5.0        3.5        1.3        0.3      Iris-setosa
41         4.5        2.3        1.3        0.3      Iris-setosa
42         4.4        3.2        1.3        0.2      Iris-setosa
43         5.0        3.5        1.6        0.6      Iris-setosa
44         5.1        3.8        1.9        0.4      Iris-setosa
45         4.8        3.0        1.4        0.3      Iris-setosa
46         5.1        3.8        1.6        0.2      Iris-setosa
47         4.6        3.2        1.4        0.2      Iris-setosa
48         5.3        3.7        1.5        0.2      Iris-setosa
49         5.0        3.3        1.4        0.2      Iris-setosa
50         7.0        3.2        4.7        1.4  Iris-versicolor
51         6.4        3.2        4.5        1.5  Iris-versicolor
52         6.9        3.1        4.9        1.5  Iris-versicolor
53         5.5        2.3        4.0        1.3  Iris-versicolor
54         6.5        2.8        4.6        1.5  Iris-versicolor
55         5.7        2.8        4.5        1.3  Iris-versicolor
56         6.3        3.3        4.7        1.6  Iris-versicolor
57         4.9        2.4        3.3        1.0  Iris-versicolor
58         6.6        2.9        4.6        1.3  Iris-versicolor
59         5.2        2.7        3.9        1.4  Iris-versicolor
60         5.0        2.0        3.5        1.0  Iris-versicolor
61         5.9        3.0        4.2        1.5  Iris-versicolor
62         6.0        2.2        4.0        1.0  Iris-versicolor
63         6.1        2.9        4.7        1.4  Iris-versicolor
64         5.6        2.9        3.6        1.3  Iris-versicolor
65         6.7        3.1        4.4        1.4  Iris-versicolor
66         5.6        3.0        4.5        1.5  Iris-versicolor
67         5.8        2.7        4.1        1.0  Iris-versicolor
68         6.2        2.2        4.5        1.5  Iris-versicolor
69         5.6        2.5        3.9        1.1  Iris-versicolor
70         5.9        3.2        4.8        1.8  Iris-versicolor
71         6.1        2.8        4.0        1.3  Iris-versicolor
72         6.3        2.5        4.9        1.5  Iris-versicolor
73         6.1        2.8        4.7        1.2  Iris-versicolor
74         6.4        2.9        4.3        1.3  Iris-versicolor
75         6.6        3.0        4.4        1.4  Iris-versicolor
76         6.8        2.8        4.8        1.4  Iris-versicolor
77         6.7        3.0        5.0        1.7  Iris-versicolor
78         6.0        2.9        4.5        1.5  Iris-versicolor
79         5.7        2.6        3.5        1.0  Iris-versicolor
80         5.5        2.4        3.8        1.1  Iris-versicolor
81         5.5        2.4        3.7        1.0  Iris-versicolor
82         5.8        2.7        3.9        1.2  Iris-versicolor
83         6.0        2.7        5.1        1.6  Iris-versicolor
84         5.4        3.0        4.5        1.5  Iris-versicolor
85         6.0        3.4        4.5        1.6  Iris-versicolor
86         6.7        3.1        4.7        1.5  Iris-versicolor
87         6.3        2.3        4.4        1.3  Iris-versicolor
88         5.6        3.0        4.1        1.3  Iris-versicolor
89         5.5        2.5        4.0        1.3  Iris-versicolor
90         5.5        2.6        4.4        1.2  Iris-versicolor
91         6.1        3.0        4.6        1.4  Iris-versicolor
92         5.8        2.6        4.0        1.2  Iris-versicolor
93         5.0        2.3        3.3        1.0  Iris-versicolor
94         5.6        2.7        4.2        1.3  Iris-versicolor
95         5.7        3.0        4.2        1.2  Iris-versicolor
96         5.7        2.9        4.2        1.3  Iris-versicolor
97         6.2        2.9        4.3        1.3  Iris-versicolor
98         5.1        2.5        3.0        1.1  Iris-versicolor
99         5.7        2.8        4.1        1.3  Iris-versicolor
100        6.3        3.3        6.0        2.5   Iris-virginica
101        5.8        2.7        5.1        1.9   Iris-virginica
102        7.1        3.0        5.9        2.1   Iris-virginica
103        6.3        2.9        5.6        1.8   Iris-virginica
104        6.5        3.0        5.8        2.2   Iris-virginica
105        7.6        3.0        6.6        2.1   Iris-virginica
106        4.9        2.5        4.5        1.7   Iris-virginica
107        7.3        2.9        6.3        1.8   Iris-virginica
108        6.7        2.5        5.8        1.8   Iris-virginica
109        7.2        3.6        6.1        2.5   Iris-virginica
110        6.5        3.2        5.1        2.0   Iris-virginica
111        6.4        2.7        5.3        1.9   Iris-virginica
112        6.8        3.0        5.5        2.1   Iris-virginica
113        5.7        2.5        5.0        2.0   Iris-virginica
114        5.8        2.8        5.1        2.4   Iris-virginica
115        6.4        3.2        5.3        2.3   Iris-virginica
116        6.5        3.0        5.5        1.8   Iris-virginica
117        7.7        3.8        6.7        2.2   Iris-virginica
118        7.7        2.6        6.9        2.3   Iris-virginica
119        6.0        2.2        5.0        1.5   Iris-virginica
120        6.9        3.2        5.7        2.3   Iris-virginica
121        5.6        2.8        4.9        2.0   Iris-virginica
122        7.7        2.8        6.7        2.0   Iris-virginica
123        6.3        2.7        4.9        1.8   Iris-virginica
124        6.7        3.3        5.7        2.1   Iris-virginica
125        7.2        3.2        6.0        1.8   Iris-virginica
126        6.2        2.8        4.8        1.8   Iris-virginica
127        6.1        3.0        4.9        1.8   Iris-virginica
128        6.4        2.8        5.6        2.1   Iris-virginica
129        7.2        3.0        5.8        1.6   Iris-virginica
130        7.4        2.8        6.1        1.9   Iris-virginica
131        7.9        3.8        6.4        2.0   Iris-virginica
132        6.4        2.8        5.6        2.2   Iris-virginica
133        6.3        2.8        5.1        1.5   Iris-virginica
134        6.1        2.6        5.6        1.4   Iris-virginica
135        7.7        3.0        6.1        2.3   Iris-virginica
136        6.3        3.4        5.6        2.4   Iris-virginica
137        6.4        3.1        5.5        1.8   Iris-virginica
138        6.0        3.0        4.8        1.8   Iris-virginica
139        6.9        3.1        5.4        2.1   Iris-virginica
140        6.7        3.1        5.6        2.4   Iris-virginica
141        6.9        3.1        5.1        2.3   Iris-virginica
142        5.8        2.7        5.1        1.9   Iris-virginica
143        6.8        3.2        5.9        2.3   Iris-virginica
144        6.7        3.3        5.7        2.5   Iris-virginica
145        6.7        3.0        5.2        2.3   Iris-virginica
146        6.3        2.5        5.0        1.9   Iris-virginica
147        6.5        3.0        5.2        2.0   Iris-virginica
148        6.2        3.4        5.4        2.3   Iris-virginica
149        5.9        3.0        5.1        1.8   Iris-virginica

In [7]:
df=pd.read_csv("Data/student-mat.csv", delimiter=";")
print(df)

    school sex  age address famsize Pstatus  Medu  Fedu      Mjob      Fjob  \
0       GP   F   18       U     GT3       A     4     4   at_home   teacher
1       GP   F   17       U     GT3       T     1     1   at_home     other
2       GP   F   15       U     LE3       T     1     1   at_home     other
3       GP   F   15       U     GT3       T     4     2    health  services
4       GP   F   16       U     GT3       T     3     3     other     other
..     ...  ..  ...     ...     ...     ...   ...   ...       ...       ...
390     MS   M   20       U     LE3       A     2     2  services  services
391     MS   M   17       U     LE3       T     3     1  services  services
392     MS   M   21       R     GT3       T     1     1     other     other
393     MS   M   18       R     LE3       T     3     2  services     other
394     MS   M   19       U     LE3       T     1     1     other   at_home

     ... famrel freetime  goout  Dalc  Walc health absences  G1  G2  G3
0    ...      4        3      4     1     1      3        6   5   6   6
1    ...      5        3      3     1     1      3        4   5   5   6
2    ...      4        3      2     2     3      3       10   7   8  10
3    ...      3        2      2     1     1      5        2  15  14  15
4    ...      4        3      2     1     2      5        4   6  10  10
..   ...    ...      ...    ...   ...   ...    ...      ...  ..  ..  ..
390  ...      5        5      4     4     5      4       11   9   9   9
391  ...      2        4      5     3     4      2        3  14  16  16
392  ...      5        5      3     3     3      3        3  10   8   7
393  ...      4        4      1     3     4      5        0  11  12  10
394  ...      3        2      3     3     3      5        5   8   9   9

[395 rows x 33 columns]

In [8]:
df=pd.read_excel("Data/sampleexcel.xlsx")
print(df)

       FL_DATE OP_UNIQUE_CARRIER  OP_CARRIER_FL_NUM ORIGIN DEST  DEP_DELAY  \
0   2019-01-01                9E               5246    MSP  MKE         33
1   2019-01-01                9E               5249    ATL  PHF          8
2   2019-01-01                9E               5249    PHF  ATL         -6
3   2019-01-01                9E               5250    MSP  CLE         10
4   2019-01-01                9E               5254    MSP  RDU         -5
..         ...               ...                ...    ...  ...        ...
194 2019-01-01                AA                459    SEA  PHX         -1
195 2019-01-01                AA                460    PHX  ORD          3
196 2019-01-01                AA                461    MCO  CLT         11
197 2019-01-01                AA                462    PHX  ATL         -2
198 2019-01-01                AA                463    MCO  PHX          8

     ARR_DELAY  CANCELLED  ACTUAL_ELAPSED_TIME
0            8          0                   64
1           -5          0                   90
2           -2          0                  121
3           -5          0                  102
4          -27          0                  139
..         ...        ...                  ...
194         33          0                  206
195         -5          0                  204
196          9          0                  104
197         -2          0                  206
198          7          0                  284

[199 rows x 9 columns]

In [9]:
df=pd.read_excel("Data/sampleexcel.xlsx", sheet_name = "chetan")
print(df)

   regno  name   phone address    m1    m2    m3    m4
0    101  anand    999     hyd  87.0  55.0   NaN  44.0
1    105    aaa    555     vij  77.0  66.0  99.0  99.0
2    109    rrr    444     vik   NaN  78.0  88.0  88.0
3    107    sss    888     sec  69.0  85.0  58.0   NaN
4    102    bbb    111     ant  89.0   NaN  99.0  99.0
5    201  anand    999     hyd  87.0  55.0   NaN  44.0
6    202    aaa    555     vij   NaN  66.0  99.0   NaN
7    203    rrr    444     vik  89.0  78.0  88.0  88.0
8    204    NaN    888     NaN  33.0  77.0  58.0   NaN
9    205    bbb    111     ant  77.0  88.0  99.0  99.0

In [10]:
df=pd.read_csv("https://raw.githubusercontent.com/12345k/IPL-Dataset/master/IPL/data.csv")
print(df)

      id  season        city        date                  team1  \
0      1    2008   Bangalore  2008-04-18  Kolkata Knight Riders
1      2    2008  Chandigarh  2008-04-19    Chennai Super Kings
2      3    2008       Delhi  2008-04-19       Rajasthan Royals
3      4    2008      Mumbai  2008-04-20         Mumbai Indians
4      5    2008     Kolkata  2008-04-20        Deccan Chargers
..   ...     ...         ...         ...                    ...
572  573    2016      Raipur  2016-05-22       Delhi Daredevils
573  574    2016   Bangalore  2016-05-24          Gujarat Lions
574  575    2016       Delhi  2016-05-25    Sunrisers Hyderabad
575  576    2016       Delhi  2016-05-27          Gujarat Lions
576  577    2016   Bangalore  2016-05-29    Sunrisers Hyderabad

                           team2                  toss_winner toss_decision  \
0    Royal Challengers Bangalore  Royal Challengers Bangalore         field
1                Kings XI Punjab          Chennai Super Kings           bat
2               Delhi Daredevils             Rajasthan Royals           bat
3    Royal Challengers Bangalore               Mumbai Indians           bat
4          Kolkata Knight Riders              Deccan Chargers           bat
..                           ...                          ...           ...
572  Royal Challengers Bangalore  Royal Challengers Bangalore         field
573  Royal Challengers Bangalore  Royal Challengers Bangalore         field
574        Kolkata Knight Riders        Kolkata Knight Riders         field
575          Sunrisers Hyderabad          Sunrisers Hyderabad         field
576  Royal Challengers Bangalore          Sunrisers Hyderabad           bat

     result  dl_applied                       winner  win_by_runs  \
0    normal           0        Kolkata Knight Riders          140
1    normal           0          Chennai Super Kings           33
2    normal           0             Delhi Daredevils            0
3    normal           0  Royal Challengers Bangalore            0
4    normal           0        Kolkata Knight Riders            0
..      ...         ...                          ...          ...
572  normal           0  Royal Challengers Bangalore            0
573  normal           0  Royal Challengers Bangalore            0
574  normal           0          Sunrisers Hyderabad           22
575  normal           0          Sunrisers Hyderabad            0
576  normal           0          Sunrisers Hyderabad            8

     win_by_wickets player_of_match  \
0                 0     BB McCullum
1                 0      MEK Hussey
2                 9     MF Maharoof
3                 5      MV Boucher
4                 5       DJ Hussey
..              ...             ...
572               6         V Kohli
573               4  AB de Villiers
574               0    MC Henriques
575               4       DA Warner
576               0     BCJ Cutting

                                                venue          umpire1  \
0                               M Chinnaswamy Stadium        Asad Rauf
1          Punjab Cricket Association Stadium, Mohali        MR Benson
2                                    Feroz Shah Kotla        Aleem Dar
3                                    Wankhede Stadium         SJ Davis
4                                        Eden Gardens        BF Bowden
..                                                ...              ...
572  Shaheed Veer Narayan Singh International Stadium   A Nand Kishore
573                             M Chinnaswamy Stadium     AK Chaudhary
574                                  Feroz Shah Kotla        M Erasmus
575                                  Feroz Shah Kotla        M Erasmus
576                             M Chinnaswamy Stadium  HDPK Dharmasena

             umpire2  umpire3
0        RE Koertzen      NaN
1         SL Shastri      NaN
2     GA Pratapkumar      NaN
3          DJ Harper      NaN
4        K Hariharan      NaN
..               ...      ...
572     BNJ Oxenford      NaN
573  HDPK Dharmasena      NaN
574    C Shamshuddin      NaN
575        CK Nandan      NaN
576     BNJ Oxenford      NaN

[577 rows x 18 columns]

In [11]:
df=pd.read_csv("Data/crops.csv")
pd.set_option("display.max_rows",None)
pd.set_option("display.max_columns",None)
print(df)

             crop     year   area     msp  yields
0            rice  2014-15  15759    1360  378216
1            rice  2015-16  15987    1414  383688
2            rice  2016-17  15747    1470  377928
3            rice  2017-18  15958    1550  382992
4            rice  2018-19  15848    1750  380352
5           maize  2014-15   1199    1310   29975
6           maize  2015-16   1227    1325   30675
7           maize  2016-17   1325    1365   33125
8           maize  2017-18   1369    1425   34225
9           maize  2018-19    951    1700   23775
10      greengram  2014-15     45    4600     225
11      greengram  2015-16     40    4850     200
12      greengram  2016-17     51    5225     255
13      greengram  2017-18     40    5575     200
14      greengram  2018-19     38    6975     190
15        redgram  2014-15     27    3175     168
16       red gram  2015-16     12    3500      72
17       red gram  2016-17     16    4000      80
18       red gram  2017-18     33    4400     165
19       red gram  2018-19     30    4600     150
20         cotton  2014-15    183    3750    1098
21         cotton  2015-16    176    3800    1056
22         cotton  2016-17    135    3860     810
23         cotton  2017-18    157    4020     942
24         cotton  2018-19     79    5150     474
25       turmeric  2014-15      3       2      30
26       turmeric  2015-16      7       2      70
27       turmeric  2016-17      2       2      20
28       turmeric  2017-18      3       2      30
29       turmeric  2018-19      6       2      60
30      sugarcane  2014-15   2627     220  525400
31      sugarcane  2015-16   1863     230  372600
32      sugarcane  2016-17   1711     230  342200
33      sugarcane  2017-18   1448     255  289600
34      sugarcane  2018-19   1266     275  253200
35          mango  2014-15   3408   10000   51015
36          mango  2015-16   2527   10100   37905
37          mango  2016-17   2092   11000   31380
38          mango  2017-18   1829   11500   87435
39          mango  2018-19   1627   13000   24405
40     cashew nut  2014-15    284   10000     568
41     cashew nut  2015-16    254   11000     508
42     cashew nut  2016-17    223   12000     446
43     cashew nut  2017-18    226   13000     452
44     cashew nut  2018-19    189   19000     378
45         banana  2014-15    116    6000   18560
46         banana  2015-16    235    7000   43600
47         banana  2016-17     76    9000   12160
48         banana  2017-18     70   10000   11200
49         banana  2018-19     36   15000    5760
50          guava  2014-15    176    9000    1760
51          guava  2015-16    242    9500    2420
52          guava  2016-17    302    9600    3020
53          guava  2017-18    345    9700    3450
54          guava  2018-19    363   10000    3630
55          lemon  2014-15     49   15000     245
56          lemon  2015-16     54   15500     270
57          lemon  2016-17     67   16000     335
58          lemon  2017-18     95   17000     475
59          lemon  2018-19     95   17500     475
60        coconut  2014-15    188    1450   56400
61        coconut  2015-16    169    1500   50700
62        coconut  2016-17    137    1600   41100
63        coconut  2017-18    152    1760   45600
64        coconut  2018-19    155    2030   46100
65         sapota  2014-15     21    6000     840
66         sapota  2015-16     79    5000    3160
67         sapota  2016-17     68    5500    2720
68         sapota  2017-18     74    6200    2960
69         sapota  2018-19     70    6500    2800
70        palmoil  2014-15   1487   30000  386620
71        palmoil  2015-16   1792   35000  465920
72        palmoil  2016-17   1866   36000  485160
73        palmoil  2017-18   1915   38000  497900
74        palmoil  2018-19   1955   40000  508300
75      eukalptus  2014-15   2003    8000  460690
76      eukalptus  2015-16   2548    8500  586040
77      eukalytus  2016-17   2585    9000  594550
78      eukalytus  2017-18   2664    9500  612720
79      eukalytus  2018-19   2668   10000  613640
80        malbari  2014-15      5   90000    2250
81        malbari  2015-16      5   80000    2850
82        malbari  2016-17     19   60000    8550
83        malbari  2017-18     17   85000    7650
84        malbari  2018-19     19   90000    8559
85     chedu vepa  2014-15     15   56000    3750
86     chedu vepa  2015-16     15   59000    3750
87     chedu vepa  2016-17     15   65000    3750
88     chedu vepa  2017-18     19   67000    4750
89     chedu vepa  2018-19     19   75000    4750
90          tekku  2014-15     25  150000      10
91          tekku  2015-16     32  160000      10
92          tekku  2016-17     34  175000      10
93          tekku  2017-18     40  189000      10
94          tekku  2018-19     40  190000      10
95  errachandanam  2014-15      5  150000      10
96  errachandanam  2015-16      5  160000      10
97  errachandanam  2016-17      9  190000      10
98  errachandanam  2017-18     10  195000      10
99  errachandanam  2018-19     12  209000      10

In [12]:
print(df.head())
print(df.head(15))
print(df.tail())
print(df.tail(15))

   crop     year   area   msp  yields
0  rice  2014-15  15759  1360  378216
1  rice  2015-16  15987  1414  383688
2  rice  2016-17  15747  1470  377928
3  rice  2017-18  15958  1550  382992
4  rice  2018-19  15848  1750  380352
         crop     year   area   msp  yields
0        rice  2014-15  15759  1360  378216
1        rice  2015-16  15987  1414  383688
2        rice  2016-17  15747  1470  377928
3        rice  2017-18  15958  1550  382992
4        rice  2018-19  15848  1750  380352
5       maize  2014-15   1199  1310   29975
6       maize  2015-16   1227  1325   30675
7       maize  2016-17   1325  1365   33125
8       maize  2017-18   1369  1425   34225
9       maize  2018-19    951  1700   23775
10  greengram  2014-15     45  4600     225
11  greengram  2015-16     40  4850     200
12  greengram  2016-17     51  5225     255
13  greengram  2017-18     40  5575     200
14  greengram  2018-19     38  6975     190
             crop     year  area     msp  yields
95  errachandanam  2014-15     5  150000      10
96  errachandanam  2015-16     5  160000      10
97  errachandanam  2016-17     9  190000      10
98  errachandanam  2017-18    10  195000      10
99  errachandanam  2018-19    12  209000      10
             crop     year  area     msp  yields
85     chedu vepa  2014-15    15   56000    3750
86     chedu vepa  2015-16    15   59000    3750
87     chedu vepa  2016-17    15   65000    3750
88     chedu vepa  2017-18    19   67000    4750
89     chedu vepa  2018-19    19   75000    4750
90          tekku  2014-15    25  150000      10
91          tekku  2015-16    32  160000      10
92          tekku  2016-17    34  175000      10
93          tekku  2017-18    40  189000      10
94          tekku  2018-19    40  190000      10
95  errachandanam  2014-15     5  150000      10
96  errachandanam  2015-16     5  160000      10
97  errachandanam  2016-17     9  190000      10
98  errachandanam  2017-18    10  195000      10
99  errachandanam  2018-19    12  209000      10

In [13]:
print(df[["crop"]])
print(df[["crop"]].head())
print(df[["crop","area","msp"]].head(15)) #Gives 3 columns - crop,area,msp
print(df[["crop","area","msp"]])

             crop
0            rice
1            rice
2            rice
3            rice
4            rice
5           maize
6           maize
7           maize
8           maize
9           maize
10      greengram
11      greengram
12      greengram
13      greengram
14      greengram
15        redgram
16       red gram
17       red gram
18       red gram
19       red gram
20         cotton
21         cotton
22         cotton
23         cotton
24         cotton
25       turmeric
26       turmeric
27       turmeric
28       turmeric
29       turmeric
30      sugarcane
31      sugarcane
32      sugarcane
33      sugarcane
34      sugarcane
35          mango
36          mango
37          mango
38          mango
39          mango
40     cashew nut
41     cashew nut
42     cashew nut
43     cashew nut
44     cashew nut
45         banana
46         banana
47         banana
48         banana
49         banana
50          guava
51          guava
52          guava
53          guava
54          guava
55          lemon
56          lemon
57          lemon
58          lemon
59          lemon
60        coconut
61        coconut
62        coconut
63        coconut
64        coconut
65         sapota
66         sapota
67         sapota
68         sapota
69         sapota
70        palmoil
71        palmoil
72        palmoil
73        palmoil
74        palmoil
75      eukalptus
76      eukalptus
77      eukalytus
78      eukalytus
79      eukalytus
80        malbari
81        malbari
82        malbari
83        malbari
84        malbari
85     chedu vepa
86     chedu vepa
87     chedu vepa
88     chedu vepa
89     chedu vepa
90          tekku
91          tekku
92          tekku
93          tekku
94          tekku
95  errachandanam
96  errachandanam
97  errachandanam
98  errachandanam
99  errachandanam
   crop
0  rice
1  rice
2  rice
3  rice
4  rice
         crop   area   msp
0        rice  15759  1360
1        rice  15987  1414
2        rice  15747  1470
3        rice  15958  1550
4        rice  15848  1750
5       maize   1199  1310
6       maize   1227  1325
7       maize   1325  1365
8       maize   1369  1425
9       maize    951  1700
10  greengram     45  4600
11  greengram     40  4850
12  greengram     51  5225
13  greengram     40  5575
14  greengram     38  6975
             crop   area     msp
0            rice  15759    1360
1            rice  15987    1414
2            rice  15747    1470
3            rice  15958    1550
4            rice  15848    1750
5           maize   1199    1310
6           maize   1227    1325
7           maize   1325    1365
8           maize   1369    1425
9           maize    951    1700
10      greengram     45    4600
11      greengram     40    4850
12      greengram     51    5225
13      greengram     40    5575
14      greengram     38    6975
15        redgram     27    3175
16       red gram     12    3500
17       red gram     16    4000
18       red gram     33    4400
19       red gram     30    4600
20         cotton    183    3750
21         cotton    176    3800
22         cotton    135    3860
23         cotton    157    4020
24         cotton     79    5150
25       turmeric      3       2
26       turmeric      7       2
27       turmeric      2       2
28       turmeric      3       2
29       turmeric      6       2
30      sugarcane   2627     220
31      sugarcane   1863     230
32      sugarcane   1711     230
33      sugarcane   1448     255
34      sugarcane   1266     275
35          mango   3408   10000
36          mango   2527   10100
37          mango   2092   11000
38          mango   1829   11500
39          mango   1627   13000
40     cashew nut    284   10000
41     cashew nut    254   11000
42     cashew nut    223   12000
43     cashew nut    226   13000
44     cashew nut    189   19000
45         banana    116    6000
46         banana    235    7000
47         banana     76    9000
48         banana     70   10000
49         banana     36   15000
50          guava    176    9000
51          guava    242    9500
52          guava    302    9600
53          guava    345    9700
54          guava    363   10000
55          lemon     49   15000
56          lemon     54   15500
57          lemon     67   16000
58          lemon     95   17000
59          lemon     95   17500
60        coconut    188    1450
61        coconut    169    1500
62        coconut    137    1600
63        coconut    152    1760
64        coconut    155    2030
65         sapota     21    6000
66         sapota     79    5000
67         sapota     68    5500
68         sapota     74    6200
69         sapota     70    6500
70        palmoil   1487   30000
71        palmoil   1792   35000
72        palmoil   1866   36000
73        palmoil   1915   38000
74        palmoil   1955   40000
75      eukalptus   2003    8000
76      eukalptus   2548    8500
77      eukalytus   2585    9000
78      eukalytus   2664    9500
79      eukalytus   2668   10000
80        malbari      5   90000
81        malbari      5   80000
82        malbari     19   60000
83        malbari     17   85000
84        malbari     19   90000
85     chedu vepa     15   56000
86     chedu vepa     15   59000
87     chedu vepa     15   65000
88     chedu vepa     19   67000
89     chedu vepa     19   75000
90          tekku     25  150000
91          tekku     32  160000
92          tekku     34  175000
93          tekku     40  189000
94          tekku     40  190000
95  errachandanam      5  150000
96  errachandanam      5  160000
97  errachandanam      9  190000
98  errachandanam     10  195000
99  errachandanam     12  209000

# Pandas Attributes

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/crops.csv")
print(df)

             crop     year   area     msp  yields
0            rice  2014-15  15759    1360  378216
1            rice  2015-16  15987    1414  383688
2            rice  2016-17  15747    1470  377928
3            rice  2017-18  15958    1550  382992
4            rice  2018-19  15848    1750  380352
..            ...      ...    ...     ...     ...
95  errachandanam  2014-15      5  150000      10
96  errachandanam  2015-16      5  160000      10
97  errachandanam  2016-17      9  190000      10
98  errachandanam  2017-18     10  195000      10
99  errachandanam  2018-19     12  209000      10

[100 rows x 5 columns]

In [3]:
print(df.dtypes) #gives data types to entire file which is having 5 columns

crop      object
year      object
area       int64
msp        int64
yields     int64
dtype: object

In [4]:
print(df["area"].dtypes) # gives data type of specific column

int64

In [5]:
print(df.columns) #gives the column names as a list

Index(['crop', 'year', 'area', 'msp', 'yields'], dtype='object')

In [6]:
print(df.axes) #gives the rows and columns names

[RangeIndex(start=0, stop=100, step=1), Index(['crop', 'year', 'area', 'msp', 'yields'], dtype='object')]

In [7]:
print(df.ndim) #gives no of dimensions

2

In [8]:
print(df.size) #Total tuples in the file i.e 100*5 = 500

500

In [9]:
print(df.shape) #gives the number of rows and columns

(100, 5)

In [10]:
print(df.values) #Numpy representation of data

[['rice' '2014-15' 15759 1360 378216]
 ['rice' '2015-16' 15987 1414 383688]
 ['rice' '2016-17' 15747 1470 377928]
 ['rice' '2017-18' 15958 1550 382992]
 ['rice' '2018-19' 15848 1750 380352]
 ['maize' '2014-15' 1199 1310 29975]
 ['maize' '2015-16' 1227 1325 30675]
 ['maize' '2016-17' 1325 1365 33125]
 ['maize' '2017-18' 1369 1425 34225]
 ['maize' '2018-19' 951 1700 23775]
 ['greengram' '2014-15' 45 4600 225]
 ['greengram' '2015-16' 40 4850 200]
 ['greengram' '2016-17' 51 5225 255]
 ['greengram' '2017-18' 40 5575 200]
 ['greengram' '2018-19' 38 6975 190]
 ['redgram' '2014-15' 27 3175 168]
 ['red gram' '2015-16' 12 3500 72]
 ['red gram' '2016-17' 16 4000 80]
 ['red gram' '2017-18' 33 4400 165]
 ['red gram' '2018-19' 30 4600 150]
 ['cotton' '2014-15' 183 3750 1098]
 ['cotton' '2015-16' 176 3800 1056]
 ['cotton' '2016-17' 135 3860 810]
 ['cotton' '2017-18' 157 4020 942]
 ['cotton' '2018-19' 79 5150 474]
 ['turmeric' '2014-15' 3 2 30]
 ['turmeric' '2015-16' 7 2 70]
 ['turmeric' '2016-17' 2 2 20]
 ['turmeric' '2017-18' 3 2 30]
 ['turmeric' '2018-19' 6 2 60]
 ['sugarcane' '2014-15' 2627 220 525400]
 ['sugarcane' '2015-16' 1863 230 372600]
 ['sugarcane' '2016-17' 1711 230 342200]
 ['sugarcane' '2017-18' 1448 255 289600]
 ['sugarcane' '2018-19' 1266 275 253200]
 ['mango' '2014-15' 3408 10000 51015]
 ['mango' '2015-16' 2527 10100 37905]
 ['mango' '2016-17' 2092 11000 31380]
 ['mango' '2017-18' 1829 11500 87435]
 ['mango' '2018-19' 1627 13000 24405]
 ['cashew nut' '2014-15' 284 10000 568]
 ['cashew nut' '2015-16' 254 11000 508]
 ['cashew nut' '2016-17' 223 12000 446]
 ['cashew nut' '2017-18' 226 13000 452]
 ['cashew nut' '2018-19' 189 19000 378]
 ['banana' '2014-15' 116 6000 18560]
 ['banana' '2015-16' 235 7000 43600]
 ['banana' '2016-17' 76 9000 12160]
 ['banana' '2017-18' 70 10000 11200]
 ['banana' '2018-19' 36 15000 5760]
 ['guava' '2014-15' 176 9000 1760]
 ['guava' '2015-16' 242 9500 2420]
 ['guava' '2016-17' 302 9600 3020]
 ['guava' '2017-18' 345 9700 3450]
 ['guava' '2018-19' 363 10000 3630]
 ['lemon' '2014-15' 49 15000 245]
 ['lemon' '2015-16' 54 15500 270]
 ['lemon' '2016-17' 67 16000 335]
 ['lemon' '2017-18' 95 17000 475]
 ['lemon' '2018-19' 95 17500 475]
 ['coconut' '2014-15' 188 1450 56400]
 ['coconut' '2015-16' 169 1500 50700]
 ['coconut' '2016-17' 137 1600 41100]
 ['coconut' '2017-18' 152 1760 45600]
 ['coconut' '2018-19' 155 2030 46100]
 ['sapota' '2014-15' 21 6000 840]
 ['sapota' '2015-16' 79 5000 3160]
 ['sapota' '2016-17' 68 5500 2720]
 ['sapota' '2017-18' 74 6200 2960]
 ['sapota' '2018-19' 70 6500 2800]
 ['palmoil' '2014-15' 1487 30000 386620]
 ['palmoil' '2015-16' 1792 35000 465920]
 ['palmoil' '2016-17' 1866 36000 485160]
 ['palmoil' '2017-18' 1915 38000 497900]
 ['palmoil' '2018-19' 1955 40000 508300]
 ['eukalptus' '2014-15' 2003 8000 460690]
 ['eukalptus' '2015-16' 2548 8500 586040]
 ['eukalytus' '2016-17' 2585 9000 594550]
 ['eukalytus' '2017-18' 2664 9500 612720]
 ['eukalytus' '2018-19' 2668 10000 613640]
 ['malbari' '2014-15' 5 90000 2250]
 ['malbari' '2015-16' 5 80000 2850]
 ['malbari' '2016-17' 19 60000 8550]
 ['malbari' '2017-18' 17 85000 7650]
 ['malbari' '2018-19' 19 90000 8559]
 ['chedu vepa' '2014-15' 15 56000 3750]
 ['chedu vepa' '2015-16' 15 59000 3750]
 ['chedu vepa' '2016-17' 15 65000 3750]
 ['chedu vepa' '2017-18' 19 67000 4750]
 ['chedu vepa' '2018-19' 19 75000 4750]
 ['tekku' '2014-15' 25 150000 10]
 ['tekku' '2015-16' 32 160000 10]
 ['tekku' '2016-17' 34 175000 10]
 ['tekku' '2017-18' 40 189000 10]
 ['tekku' '2018-19' 40 190000 10]
 ['errachandanam' '2014-15' 5 150000 10]
 ['errachandanam' '2015-16' 5 160000 10]
 ['errachandanam' '2016-17' 9 190000 10]
 ['errachandanam' '2017-18' 10 195000 10]
 ['errachandanam' '2018-19' 12 209000 10]]

In [11]:
print(df.info)

<bound method DataFrame.info of              crop     year   area     msp  yields
0            rice  2014-15  15759    1360  378216
1            rice  2015-16  15987    1414  383688
2            rice  2016-17  15747    1470  377928
3            rice  2017-18  15958    1550  382992
4            rice  2018-19  15848    1750  380352
..            ...      ...    ...     ...     ...
95  errachandanam  2014-15      5  150000      10
96  errachandanam  2015-16      5  160000      10
97  errachandanam  2016-17      9  190000      10
98  errachandanam  2017-18     10  195000      10
99  errachandanam  2018-19     12  209000      10

[100 rows x 5 columns]>

# Pandas Methods

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/crops.csv")

In [3]:
print(df.describe ()) #Gives the description of crops data

               area            msp         yields
count    100.000000     100.000000     100.000000
mean    1333.040000   31363.090000   97007.270000
std     3454.998174   53527.125655  181610.087946
min        2.000000       2.000000      10.000000
25%       29.250000    2888.750000     252.500000
50%      125.500000    9000.000000    3305.000000
75%     1336.000000   21750.000000   45725.000000
max    15987.000000  209000.000000  613640.000000

In [4]:
print(df.max()) #Gives the maximum value of entire data set

crop      turmeric
year       2018-19
area         15987
msp         209000
yields      613640
dtype: object

In [5]:
print(df["area"].max()) #Gives the maximum value of particular value

15987

In [6]:
print(df["area"].min())

2

In [7]:
print(df.mean())

area       1333.04
msp       31363.09
yields    97007.27
dtype: float64

C:\Users\Dell\AppData\Local\Temp\ipykernel_8892\2807316344.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(df.mean())

In [8]:
print(df["area"].mean())

1333.04

In [9]:
print(df.std()) #standard deviation

area        3454.998174
msp        53527.125655
yields    181610.087946
dtype: float64

C:\Users\Dell\AppData\Local\Temp\ipykernel_8892\1717847374.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print(df.std()) #standard deviation

In [10]:
print(df["crop"].unique()) #get unique values of that column

['rice' 'maize' 'greengram' 'redgram' 'red gram' 'cotton' 'turmeric'
 'sugarcane' 'mango' 'cashew nut' 'banana' 'guava' 'lemon' 'coconut'
 'sapota' 'palmoil' 'eukalptus' 'eukalytus' 'malbari' 'chedu vepa' 'tekku'
 'errachandanam']

In [11]:
print(df["area"].unique())

[15759 15987 15747 15958 15848  1199  1227  1325  1369   951    45    40
    51    38    27    12    16    33    30   183   176   135   157    79
     3     7     2     6  2627  1863  1711  1448  1266  3408  2527  2092
  1829  1627   284   254   223   226   189   116   235    76    70    36
   242   302   345   363    49    54    67    95   188   169   137   152
   155    21    68    74  1487  1792  1866  1915  1955  2003  2548  2585
  2664  2668     5    19    17    15    25    32    34     9    10]

In [12]:
df1=df
df["crop"]=df.crop.replace("red gram","redgram")
df["crop"]=df.crop.replace("eukalytus","eukalptus")
print(df["crop"].unique())
print(df.head(25))

['rice' 'maize' 'greengram' 'redgram' 'cotton' 'turmeric' 'sugarcane'
 'mango' 'cashew nut' 'banana' 'guava' 'lemon' 'coconut' 'sapota'
 'palmoil' 'eukalptus' 'malbari' 'chedu vepa' 'tekku' 'errachandanam']
         crop     year   area   msp  yields
0        rice  2014-15  15759  1360  378216
1        rice  2015-16  15987  1414  383688
2        rice  2016-17  15747  1470  377928
3        rice  2017-18  15958  1550  382992
4        rice  2018-19  15848  1750  380352
5       maize  2014-15   1199  1310   29975
6       maize  2015-16   1227  1325   30675
7       maize  2016-17   1325  1365   33125
8       maize  2017-18   1369  1425   34225
9       maize  2018-19    951  1700   23775
10  greengram  2014-15     45  4600     225
11  greengram  2015-16     40  4850     200
12  greengram  2016-17     51  5225     255
13  greengram  2017-18     40  5575     200
14  greengram  2018-19     38  6975     190
15    redgram  2014-15     27  3175     168
16    redgram  2015-16     12  3500      72
17    redgram  2016-17     16  4000      80
18    redgram  2017-18     33  4400     165
19    redgram  2018-19     30  4600     150
20     cotton  2014-15    183  3750    1098
21     cotton  2015-16    176  3800    1056
22     cotton  2016-17    135  3860     810
23     cotton  2017-18    157  4020     942
24     cotton  2018-19     79  5150     474

In [13]:
df1=df["crop"]
df1=df.crop.replace("red gram","redgram")
df1=df.crop.replace("eukalytus","eukalptus")
print(df1)

0              rice
1              rice
2              rice
3              rice
4              rice
          ...
95    errachandanam
96    errachandanam
97    errachandanam
98    errachandanam
99    errachandanam
Name: crop, Length: 100, dtype: object

In [14]:
print(df1.head(30))

0          rice
1          rice
2          rice
3          rice
4          rice
5         maize
6         maize
7         maize
8         maize
9         maize
10    greengram
11    greengram
12    greengram
13    greengram
14    greengram
15      redgram
16      redgram
17      redgram
18      redgram
19      redgram
20       cotton
21       cotton
22       cotton
23       cotton
24       cotton
25     turmeric
26     turmeric
27     turmeric
28     turmeric
29     turmeric
Name: crop, dtype: object

In [15]:
print(df["crop"].value_counts()) #Get the unique category counts
print(df["area"].value_counts())

rice             5
maize            5
tekku            5
chedu vepa       5
malbari          5
eukalptus        5
palmoil          5
sapota           5
coconut          5
lemon            5
guava            5
banana           5
cashew nut       5
mango            5
sugarcane        5
turmeric         5
cotton           5
redgram          5
greengram        5
errachandanam    5
Name: crop, dtype: int64
19      4
5       4
40      4
15      3
95      2
       ..
1711    1
1863    1
2627    1
6       1
10      1
Name: area, Length: 83, dtype: int64

In [16]:
df1=df.sample(n=15)
print(df1)

             crop     year  area     msp  yields
89     chedu vepa  2018-19    19   75000    4750
31      sugarcane  2015-16  1863     230  372600
70        palmoil  2014-15  1487   30000  386620
61        coconut  2015-16   169    1500   50700
22         cotton  2016-17   135    3860     810
47         banana  2016-17    76    9000   12160
45         banana  2014-15   116    6000   18560
50          guava  2014-15   176    9000    1760
80        malbari  2014-15     5   90000    2250
40     cashew nut  2014-15   284   10000     568
98  errachandanam  2017-18    10  195000      10
79      eukalptus  2018-19  2668   10000  613640
12      greengram  2016-17    51    5225     255
5           maize  2014-15  1199    1310   29975
51          guava  2015-16   242    9500    2420

In [20]:
df1=df.loc[51:75,["crop","area","yields"]] #.loc[from:to,["c1","c2","c3"]] #.loc[rows,columns]
print(df1) #Gives records from 5 - 15 for 3 columns

         crop  area  yields
51      guava   242    2420
52      guava   302    3020
53      guava   345    3450
54      guava   363    3630
55      lemon    49     245
56      lemon    54     270
57      lemon    67     335
58      lemon    95     475
59      lemon    95     475
60    coconut   188   56400
61    coconut   169   50700
62    coconut   137   41100
63    coconut   152   45600
64    coconut   155   46100
65     sapota    21     840
66     sapota    79    3160
67     sapota    68    2720
68     sapota    74    2960
69     sapota    70    2800
70    palmoil  1487  386620
71    palmoil  1792  465920
72    palmoil  1866  485160
73    palmoil  1915  497900
74    palmoil  1955  508300
75  eukalptus  2003  460690

In [22]:
print(df.loc[51:69])
print(df.loc[84:,["crop","year","area"]])

       crop     year  area    msp  yields
51    guava  2015-16   242   9500    2420
52    guava  2016-17   302   9600    3020
53    guava  2017-18   345   9700    3450
54    guava  2018-19   363  10000    3630
55    lemon  2014-15    49  15000     245
56    lemon  2015-16    54  15500     270
57    lemon  2016-17    67  16000     335
58    lemon  2017-18    95  17000     475
59    lemon  2018-19    95  17500     475
60  coconut  2014-15   188   1450   56400
61  coconut  2015-16   169   1500   50700
62  coconut  2016-17   137   1600   41100
63  coconut  2017-18   152   1760   45600
64  coconut  2018-19   155   2030   46100
65   sapota  2014-15    21   6000     840
66   sapota  2015-16    79   5000    3160
67   sapota  2016-17    68   5500    2720
68   sapota  2017-18    74   6200    2960
69   sapota  2018-19    70   6500    2800
             crop     year  area
84        malbari  2018-19    19
85     chedu vepa  2014-15    15
86     chedu vepa  2015-16    15
87     chedu vepa  2016-17    15
88     chedu vepa  2017-18    19
89     chedu vepa  2018-19    19
90          tekku  2014-15    25
91          tekku  2015-16    32
92          tekku  2016-17    34
93          tekku  2017-18    40
94          tekku  2018-19    40
95  errachandanam  2014-15     5
96  errachandanam  2015-16     5
97  errachandanam  2016-17     9
98  errachandanam  2017-18    10
99  errachandanam  2018-19    12

In [23]:
print(df.iloc[10:20,[1,2,4]]) #Gives the data based on the index number of column
print(df.iloc[10:20,1:4]) #
print(df.iloc[:,[0,2,3]])
print(df.iloc[10:20])
print(df.iloc[:20])
print(df.iloc[:,-1])

       year  area  yields
10  2014-15    45     225
11  2015-16    40     200
12  2016-17    51     255
13  2017-18    40     200
14  2018-19    38     190
15  2014-15    27     168
16  2015-16    12      72
17  2016-17    16      80
18  2017-18    33     165
19  2018-19    30     150
       year  area   msp
10  2014-15    45  4600
11  2015-16    40  4850
12  2016-17    51  5225
13  2017-18    40  5575
14  2018-19    38  6975
15  2014-15    27  3175
16  2015-16    12  3500
17  2016-17    16  4000
18  2017-18    33  4400
19  2018-19    30  4600
             crop   area     msp
0            rice  15759    1360
1            rice  15987    1414
2            rice  15747    1470
3            rice  15958    1550
4            rice  15848    1750
..            ...    ...     ...
95  errachandanam      5  150000
96  errachandanam      5  160000
97  errachandanam      9  190000
98  errachandanam     10  195000
99  errachandanam     12  209000

[100 rows x 3 columns]
         crop     year  area   msp  yields
10  greengram  2014-15    45  4600     225
11  greengram  2015-16    40  4850     200
12  greengram  2016-17    51  5225     255
13  greengram  2017-18    40  5575     200
14  greengram  2018-19    38  6975     190
15    redgram  2014-15    27  3175     168
16    redgram  2015-16    12  3500      72
17    redgram  2016-17    16  4000      80
18    redgram  2017-18    33  4400     165
19    redgram  2018-19    30  4600     150
         crop     year   area   msp  yields
0        rice  2014-15  15759  1360  378216
1        rice  2015-16  15987  1414  383688
2        rice  2016-17  15747  1470  377928
3        rice  2017-18  15958  1550  382992
4        rice  2018-19  15848  1750  380352
5       maize  2014-15   1199  1310   29975
6       maize  2015-16   1227  1325   30675
7       maize  2016-17   1325  1365   33125
8       maize  2017-18   1369  1425   34225
9       maize  2018-19    951  1700   23775
10  greengram  2014-15     45  4600     225
11  greengram  2015-16     40  4850     200
12  greengram  2016-17     51  5225     255
13  greengram  2017-18     40  5575     200
14  greengram  2018-19     38  6975     190
15    redgram  2014-15     27  3175     168
16    redgram  2015-16     12  3500      72
17    redgram  2016-17     16  4000      80
18    redgram  2017-18     33  4400     165
19    redgram  2018-19     30  4600     150
0     378216
1     383688
2     377928
3     382992
4     380352
       ...
95        10
96        10
97        10
98        10
99        10
Name: yields, Length: 100, dtype: int64

# Data Filtering

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/movie_metadata.csv")

In [3]:
dt=df[df["duration"]>170] #Row filtering
print(dt)

                 color     director_name  num_critic_for_reviews  duration  \
0                Color     James Cameron                   723.0     178.0
10               Color       Zack Snyder                   673.0     183.0
17               Color       Joss Whedon                   703.0     173.0
23               Color     Peter Jackson                   509.0     186.0
25               Color     Peter Jackson                   446.0     201.0
...                ...               ...                     ...       ...
4113             Color               NaN                    10.0     173.0
4238   Black and White     William Wyler                    97.0     172.0
4694             Color     Peter Jackson                   446.0     201.0
4708             Color  Michael Wadleigh                    53.0     215.0
4747   Black and White    Akira Kurosawa                   153.0     202.0

      director_facebook_likes  actor_3_facebook_likes        actor_2_name  \
0                         0.0                   855.0    Joel David Moore
10                        0.0                  2000.0        Lauren Cohan
17                        0.0                 19000.0   Robert Downey Jr.
23                        0.0                   773.0          Adam Brown
25                        0.0                    84.0  Thomas Kretschmann
...                       ...                     ...                 ...
4113                      NaN                   476.0          Colm Feore
4238                    355.0                   188.0       Teresa Wright
4694                      0.0                    84.0  Thomas Kretschmann
4708                     14.0                   136.0        Jimi Hendrix
4747                      0.0                     4.0       Minoru Chiaki

      actor_1_facebook_likes        gross                           genres  \
0                     1000.0  760505847.0  Action|Adventure|Fantasy|Sci-Fi
10                   15000.0  330249062.0          Action|Adventure|Sci-Fi
17                   26000.0  623279547.0          Action|Adventure|Sci-Fi
23                    5000.0  258355354.0                Adventure|Fantasy
25                    6000.0  218051260.0   Action|Adventure|Drama|Romance
...                      ...          ...                              ...
4113                   723.0          NaN           Horror|Sci-Fi|Thriller
4238                   749.0   23650000.0                Drama|Romance|War
4694                  6000.0  218051260.0   Action|Adventure|Drama|Romance
4708                   262.0   13300000.0        Documentary|History|Music
4747                   304.0     269061.0           Action|Adventure|Drama

      ... num_user_for_reviews  language      country  content_rating  \
0     ...               3054.0   English          USA           PG-13
10    ...               3018.0   English          USA           PG-13
17    ...               1722.0   English          USA           PG-13
23    ...                951.0   English          USA           PG-13
25    ...               2618.0   English  New Zealand           PG-13
...   ...                  ...       ...          ...             ...
4113  ...                 33.0   English          USA             NaN
4238  ...                235.0   English          USA       Not Rated
4694  ...               2618.0   English  New Zealand           PG-13
4708  ...                 63.0   English          USA               R
4747  ...                596.0  Japanese        Japan         Unrated

           budget  title_year actor_2_facebook_likes imdb_score  aspect_ratio  \
0     237000000.0      2009.0                  936.0        7.9          1.78
10    250000000.0      2016.0                 4000.0        6.9          2.35
17    220000000.0      2012.0                21000.0        8.1          1.85
23    225000000.0      2013.0                  972.0        7.9          2.35
25    207000000.0      2005.0                  919.0        7.2          2.35
...           ...         ...                    ...        ...           ...
4113          NaN         NaN                  539.0        5.0          1.78
4238    2100000.0      1946.0                  208.0        8.1          1.37
4694  207000000.0      2005.0                  918.0        7.2          2.35
4708     600000.0      1970.0                  227.0        8.1          2.20
4747    2000000.0      1954.0                    8.0        8.7          1.37

     movie_facebook_likes
0                   33000
10                 197000
17                 123000
23                  83000
25                      0
...                   ...
4113                  518
4238                    0
4694                    0
4708                    0
4747                11000

[102 rows x 28 columns]

In [4]:
print(dt[["director_name","movie_title","duration"]]) #Column filtering

         director_name                           movie_title  duration
0        James Cameron                               Avatar      178.0
10         Zack Snyder   Batman v Superman: Dawn of Justice      183.0
17         Joss Whedon                         The Avengers      173.0
23       Peter Jackson  The Hobbit: The Desolation of Smaug      186.0
25       Peter Jackson                            King Kong      201.0
...                ...                                   ...       ...
4113               NaN                 Creature                  173.0
4238     William Wyler          The Best Years of Our Lives      172.0
4694     Peter Jackson                            King Kong      201.0
4708  Michael Wadleigh                            Woodstock      215.0
4747    Akira Kurosawa                        Seven Samurai      202.0

[102 rows x 3 columns]

In [5]:
dt[["director_name","movie_title","duration"]]

         director_name                           movie_title  duration
0        James Cameron                               Avatar      178.0
10         Zack Snyder   Batman v Superman: Dawn of Justice      183.0
17         Joss Whedon                         The Avengers      173.0
23       Peter Jackson  The Hobbit: The Desolation of Smaug      186.0
25       Peter Jackson                            King Kong      201.0
...                ...                                   ...       ...
4113               NaN                 Creature                  173.0
4238     William Wyler          The Best Years of Our Lives      172.0
4694     Peter Jackson                            King Kong      201.0
4708  Michael Wadleigh                            Woodstock      215.0
4747    Akira Kurosawa                        Seven Samurai      202.0

[102 rows x 3 columns]

In [6]:
print(df[(df.duration>160)&(df.num_critic_for_reviews<100)&(df.country=="USA")])

                 color         director_name  num_critic_for_reviews  \
76               Color        Kevin Reynolds                    91.0
420              Color          Martin Brest                    98.0
499              Color         Kevin Costner                    79.0
606              Color         James Cameron                    82.0
698              Color       Lawrence Kasdan                    40.0
735              Color        Robert Redford                    96.0
883              Color           Ron Maxwell                    84.0
909              Color        Jonathan Demme                    78.0
1124             Color    Billy Bob Thornton                    85.0
1125   Black and White          Oliver Stone                    83.0
1429             Color             Spike Lee                    61.0
1501             Color       Taylor Hackford                    12.0
1523             Color         Warren Beatty                    57.0
1575             Color        Sydney Pollack                    66.0
1813             Color        Philip Kaufman                    80.0
1843   Black and White  Richard Attenborough                    56.0
1980             Color           Ron Maxwell                    22.0
2092             Color   Christopher Spencer                    61.0
2266             Color        George Stevens                    27.0
2356             Color         Kevin Costner                    92.0
2379             Color          Anthony Mann                    30.0
2487             Color          George Cukor                    82.0
2727             Color                   NaN                     9.0
3026             Color            David Lean                    89.0
3101   Black and White           Ken Annakin                    53.0
3267             Color        Stanley Kramer                    61.0
3280             Color        Norman Jewison                    66.0
3352             Color          Mervyn LeRoy                    54.0
3958             Color         Peter H. Hunt                    34.0
4077   Black and White        Stanley Kramer                    73.0
4113             Color                   NaN                    10.0
4238   Black and White         William Wyler                    97.0
4688             Color           Steve James                    53.0
4708             Color      Michael Wadleigh                    53.0

      duration  director_facebook_likes  actor_3_facebook_likes  \
76       176.0                     58.0                    60.0
420      178.0                    102.0                   551.0
499      177.0                      0.0                   582.0
606      171.0                      0.0                   638.0
698      212.0                    759.0                   812.0
735      170.0                      0.0                   380.0
883      280.0                     33.0                    67.0
909      172.0                    438.0                   466.0
1124     220.0                      0.0                   820.0
1125     212.0                      0.0                   805.0
1429     202.0                      0.0                   318.0
1501     330.0                    138.0                   672.0
1523     195.0                    631.0                   521.0
1575     161.0                    521.0                   184.0
1813     193.0                    133.0                   820.0
1843     175.0                      0.0                    14.0
1980     271.0                     33.0                   251.0
2092     170.0                     25.0                    55.0
2266     225.0                    126.0                   202.0
2356     236.0                      0.0                   232.0
2379     172.0                     75.0                   102.0
2487     170.0                    165.0                   244.0
2727     286.0                      NaN                   527.0
3026     200.0                    767.0                   382.0
3101     178.0                     19.0                   196.0
3267     197.0                    176.0                   760.0
3280     181.0                    278.0                    51.0
3352     171.0                     54.0                   346.0
3958     168.0                      0.0                    69.0
4077     186.0                    176.0                   760.0
4113     173.0                      NaN                   476.0
4238     172.0                    355.0                   188.0
4688     170.0                     23.0                     2.0
4708     215.0                     14.0                   136.0

                 actor_2_name  actor_1_facebook_likes        gross  \
76                Rick Aviles                   711.0   88246220.0
420                 Brad Pitt                 12000.0   44606335.0
499      Brian Anthony Wilson                   766.0   17593391.0
606                Todd Graff                  2000.0   54222000.0
698          Catherine O'Hara                  2000.0   25052000.0
735      Kristin Scott Thomas                 19000.0   75370763.0
883          Bruce Boxleitner                   789.0   12870569.0
909            Kimberly Elise                   852.0   22843047.0
1124             Henry Thomas                 13000.0   15527125.0
1125              Bob Hoskins                 12000.0   13560960.0
1429             Delroy Lindo                 18000.0   48169908.0
1501            Jesse Borrego                   848.0    4496583.0
1523            Warren Beatty                   635.0          NaN
1575            Michael Gough                 11000.0   87100000.0
1813              Scott Glenn                  2000.0   21500000.0
1843             Dirk Bogarde                   385.0   50800000.0
1980  William Morgan Sheppard                   854.0   10769960.0
2092         Amber Rose Revah                   329.0   59696176.0
2266            Carroll Baker                   940.0    8000000.0
2356           Michael Spears                   933.0  184208848.0
2379               Mel Ferrer                   617.0          NaN
2487             Rex Harrison                   453.0   72000000.0
2727            Tom Hollander                   857.0          NaN
3026             Klaus Kinski                   597.0  111722000.0
3101           Richard Beymer                   726.0          NaN
3267               Sid Caesar                   924.0   46300000.0
3280      Paul Michael Glaser                   402.0   50000000.0
3352             Deborah Kerr                   440.0          NaN
3958               Ken Howard                   713.0          NaN
4077         Montgomery Clift                   877.0          NaN
4113               Colm Feore                   723.0          NaN
4238            Teresa Wright                   749.0   23650000.0
4688              Arthur Agee                     7.0    7830611.0
4708             Jimi Hendrix                   262.0   13300000.0

                                       genres  ... num_user_for_reviews  \
76           Action|Adventure|Sci-Fi|Thriller  ...                309.0
420                     Drama|Fantasy|Romance  ...                703.0
499             Action|Adventure|Drama|Sci-Fi  ...                376.0
606           Adventure|Drama|Sci-Fi|Thriller  ...                380.0
698   Adventure|Biography|Crime|Drama|Western  ...                145.0
735                     Drama|Romance|Western  ...                263.0
883                         Drama|History|War  ...                497.0
909                      Drama|History|Horror  ...                207.0
1124                    Drama|Romance|Western  ...                183.0
1125                  Biography|Drama|History  ...                161.0
1429          Biography|Drama|History|Romance  ...                156.0
1501                              Crime|Drama  ...                129.0
1523          Biography|Drama|History|Romance  ...                127.0
1575                  Biography|Drama|Romance  ...                200.0
1813                  Adventure|Drama|History  ...                170.0
1843                        Drama|History|War  ...                210.0
1980                        Drama|History|War  ...                256.0
2092                  Biography|Drama|History  ...                174.0
2266                  Biography|Drama|History  ...                100.0
2356                  Adventure|Drama|Western  ...                382.0
2379                        Drama|History|War  ...                 91.0
2487             Drama|Family|Musical|Romance  ...                258.0
2727                   Drama|History|Thriller  ...                 39.0
3026                        Drama|Romance|War  ...                255.0
3101                 Action|Drama|History|War  ...                192.0
3267            Action|Adventure|Comedy|Crime  ...                344.0
3280             Drama|Family|Musical|Romance  ...                150.0
3352          Biography|Drama|History|Romance  ...                 90.0
3958             Drama|Family|History|Musical  ...                129.0
4077                                Drama|War  ...                176.0
4113                   Horror|Sci-Fi|Thriller  ...                 33.0
4238                        Drama|Romance|War  ...                235.0
4688                  Documentary|Drama|Sport  ...                 74.0
4708                Documentary|History|Music  ...                 63.0

     language  country  content_rating       budget  title_year  \
76    English      USA           PG-13  175000000.0      1995.0
420   English      USA           PG-13   90000000.0      1998.0
499   English      USA               R   80000000.0      1997.0
606   English      USA           PG-13   69500000.0      1989.0
698   English      USA           PG-13   63000000.0      1994.0
735   English      USA           PG-13   60000000.0      1998.0
883   English      USA           PG-13   56000000.0      2003.0
909   English      USA               R   55000000.0      1998.0
1124  English      USA           PG-13   57000000.0      2000.0
1125  English      USA               R   50000000.0      1995.0
1429  English      USA           PG-13   33000000.0      1992.0
1501  English      USA               R   35000000.0      1993.0
1523  English      USA              PG   35000000.0      1981.0
1575  English      USA              PG   31000000.0      1985.0
1813  English      USA              PG   27000000.0      1983.0
1843  English      USA              PG   26000000.0      1977.0
1980  English      USA              PG   25000000.0      1993.0
2092  English      USA           PG-13   22000000.0      2014.0
2266  English      USA               G   20000000.0      1965.0
2356  English      USA           PG-13   22000000.0      1990.0
2379  English      USA        Approved   19000000.0      1964.0
2487  English      USA        Approved   17000000.0      1964.0
2727  English      USA             NaN          NaN         NaN
3026  English      USA           PG-13   11000000.0      1965.0
3101  English      USA               G   10000000.0      1962.0
3267  English      USA        Approved    9400000.0      1963.0
3280  English      USA               G    9000000.0      1971.0
3352  English      USA          Passed    7623000.0      1951.0
3958  English      USA              PG    4000000.0      1972.0
4077  English      USA       Not Rated    3000000.0      1961.0
4113  English      USA             NaN          NaN         NaN
4238  English      USA       Not Rated    2100000.0      1946.0
4688  English      USA           PG-13     700000.0      1994.0
4708  English      USA               R     600000.0      1970.0

     actor_2_facebook_likes imdb_score  aspect_ratio movie_facebook_likes
76                     60.0        6.1          1.85                    0
420                 11000.0        7.1          1.85                10000
499                   674.0        6.0          2.35                    0
606                   650.0        7.6          2.35                    0
698                   925.0        6.6          2.35                    0
735                  1000.0        6.5          1.85                    0
883                   640.0        6.3          2.35                  953
909                   637.0        5.9          1.85                  853
1124                  861.0        5.8          2.35                  652
1125                 5000.0        7.1          2.35                  915
1429                  848.0        7.7          1.85                    0
1501                  674.0        8.0          1.66                 6000
1523                  631.0        7.5          1.85                    0
1575                  920.0        7.2          1.85                    0
1813                  826.0        7.9          1.85                    0
1843                  232.0        7.4          2.35                    0
1980                  702.0        7.7          1.85                    0
2092                  134.0        5.6          2.35                15000
2266                  208.0        6.6          2.76                 1000
2356                  839.0        8.0          2.35                    0
2379                  134.0        6.7          2.20                  560
2487                  272.0        7.9          2.20                    0
2727                  555.0        7.9          1.78                  733
3026                  396.0        8.0          2.35                 7000
3101                  249.0        7.8          2.35                    0
3267                  898.0        7.6          2.76                    0
3280                  343.0        8.0          2.35                    0
3352                  426.0        7.2          1.37                 1000
3958                  649.0        7.6          2.35                    0
4077                  862.0        8.3          1.75                    0
4113                  539.0        5.0          1.78                  518
4238                  208.0        8.1          1.37                    0
4688                    6.0        8.3          1.33                    0
4708                  227.0        8.1          2.20                    0

[34 rows x 28 columns]

In [7]:
dt=df[(df.duration>=160)&(df.duration<200)]

In [8]:
print(dt)

                 color      director_name  num_critic_for_reviews  duration  \
0                Color      James Cameron                   723.0     178.0
1                Color     Gore Verbinski                   302.0     169.0
3                Color  Christopher Nolan                   813.0     164.0
10               Color        Zack Snyder                   673.0     183.0
11               Color       Bryan Singer                   434.0     169.0
...                ...                ...                     ...       ...
4238   Black and White      William Wyler                    97.0     172.0
4351             Color               Remo                    15.0     160.0
4572   Black and White     Khalid Mohamed                     1.0     167.0
4593             Color    Vivek Agnihotri                     4.0     160.0
4688             Color        Steve James                    53.0     170.0

      director_facebook_likes  actor_3_facebook_likes      actor_2_name  \
0                         0.0                   855.0  Joel David Moore
1                       563.0                  1000.0     Orlando Bloom
3                     22000.0                 23000.0    Christian Bale
10                        0.0                  2000.0      Lauren Cohan
11                        0.0                   903.0     Marlon Brando
...                       ...                     ...               ...
4238                    355.0                   188.0     Teresa Wright
4351                    168.0                    71.0              Remo
4572                     10.0                    97.0    Manoj Bajpayee
4593                      5.0                   219.0       Anil Kapoor
4688                     23.0                     2.0       Arthur Agee

      actor_1_facebook_likes        gross                           genres  \
0                     1000.0  760505847.0  Action|Adventure|Fantasy|Sci-Fi
1                    40000.0  309404152.0         Action|Adventure|Fantasy
3                    27000.0  448130642.0                  Action|Thriller
10                   15000.0  330249062.0          Action|Adventure|Sci-Fi
11                   18000.0  200069408.0          Action|Adventure|Sci-Fi
...                      ...          ...                              ...
4238                   749.0   23650000.0                Drama|Romance|War
4351                   733.0      95236.0                    Drama|Musical
4572                   353.0     610991.0                    Drama|Romance
4593                   724.0      49000.0                         Thriller
4688                     7.0    7830611.0          Documentary|Drama|Sport

      ... num_user_for_reviews language  country  content_rating       budget  \
0     ...               3054.0  English      USA           PG-13  237000000.0
1     ...               1238.0  English      USA           PG-13  300000000.0
3     ...               2701.0  English      USA           PG-13  250000000.0
10    ...               3018.0  English      USA           PG-13  250000000.0
11    ...               2367.0  English      USA           PG-13  209000000.0
...   ...                  ...      ...      ...             ...          ...
4238  ...                235.0  English      USA       Not Rated    2100000.0
4351  ...                 38.0    Hindi    India       Not Rated          NaN
4572  ...                 19.0    Hindi    India             NaN    1000000.0
4593  ...                 30.0    Hindi    India             NaN    1500000.0
4688  ...                 74.0  English      USA           PG-13     700000.0

      title_year actor_2_facebook_likes imdb_score  aspect_ratio  \
0         2009.0                  936.0        7.9          1.78
1         2007.0                 5000.0        7.1          2.35
3         2012.0                23000.0        8.5          2.35
10        2016.0                 4000.0        6.9          2.35
11        2006.0                10000.0        6.1          2.35
...          ...                    ...        ...           ...
4238      1946.0                  208.0        8.1          1.37
4351      2013.0                  168.0        6.4           NaN
4572      2000.0                  186.0        6.2          2.35
4593      2005.0                  668.0        4.8           NaN
4688      1994.0                    6.0        8.3          1.33

     movie_facebook_likes
0                   33000
1                       0
3                  164000
10                 197000
11                      0
...                   ...
4238                    0
4351                 1000
4572                   92
4593                   31
4688                    0

[103 rows x 28 columns]

In [9]:
print(dt[["director_name","movie_title","duration"]])

          director_name                                movie_title  duration
0         James Cameron                                    Avatar      178.0
1        Gore Verbinski  Pirates of the Caribbean: At World's End      169.0
3     Christopher Nolan                     The Dark Knight Rises      164.0
10          Zack Snyder        Batman v Superman: Dawn of Justice      183.0
11         Bryan Singer                          Superman Returns      169.0
...                 ...                                        ...       ...
4238      William Wyler               The Best Years of Our Lives      172.0
4351               Remo                 ABCD (Any Body Can Dance)      160.0
4572     Khalid Mohamed                                      Fiza      167.0
4593    Vivek Agnihotri              Chocolate: Deep Dark Secrets      160.0
4688        Steve James                               Hoop Dreams      170.0

[103 rows x 3 columns]

In [10]:
dt=df[df.genres=="Drama"]
print(dt["movie_title"])

607     Wall Street: Money Never Sleeps
669                     Mona Lisa Smile
683                          Fight Club
751                      A Civil Action
1147                  Finding Forrester
                      ...
5003                 The Exploding Girl
5018                           Flywheel
5022               Stories of Our Lives
5027                         The Circle
5030                     On the Downlow
Name: movie_title, Length: 236, dtype: object

In [11]:
dt=df[(df.genres=="Drama")|(df.genres=="Action|Thriller")]
print(dt["movie_title"])

3        The Dark Knight Rises
225               Jason Bourne
347     A Good Day to Die Hard
354                Unstoppable
591                 Die Hard 2
                 ...
5003        The Exploding Girl
5018                  Flywheel
5022      Stories of Our Lives
5027                The Circle
5030            On the Downlow
Name: movie_title, Length: 266, dtype: object

# Handling NaN (null) Values

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/movie_metadata.csv")

In [3]:
print(df.isnull()) #Gives the data as True if it finds an null or NaN value in the dataset else gives the data as False

      color  director_name  num_critic_for_reviews  duration  \
0     False          False                   False     False
1     False          False                   False     False
2     False          False                   False     False
3     False          False                   False     False
4      True          False                    True      True
...     ...            ...                     ...       ...
5038  False          False                   False     False
5039  False           True                   False     False
5040  False          False                   False     False
5041  False          False                   False     False
5042  False          False                   False     False

      director_facebook_likes  actor_3_facebook_likes  actor_2_name  \
0                       False                   False         False
1                       False                   False         False
2                       False                   False         False
3                       False                   False         False
4                       False                    True         False
...                       ...                     ...           ...
5038                    False                   False         False
5039                     True                   False         False
5040                    False                   False         False
5041                    False                   False         False
5042                    False                   False         False

      actor_1_facebook_likes  gross  genres  ...  num_user_for_reviews  \
0                      False  False   False  ...                 False
1                      False  False   False  ...                 False
2                      False  False   False  ...                 False
3                      False  False   False  ...                 False
4                      False   True   False  ...                  True
...                      ...    ...     ...  ...                   ...
5038                   False   True   False  ...                 False
5039                   False   True   False  ...                 False
5040                   False   True   False  ...                 False
5041                   False  False   False  ...                 False
5042                   False  False   False  ...                 False

      language  country  content_rating  budget  title_year  \
0        False    False           False   False       False
1        False    False           False   False       False
2        False    False           False   False       False
3        False    False           False   False       False
4         True     True            True    True        True
...        ...      ...             ...     ...         ...
5038     False    False            True    True       False
5039     False    False           False    True        True
5040     False    False            True   False       False
5041     False    False           False    True       False
5042     False    False           False   False       False

      actor_2_facebook_likes  imdb_score  aspect_ratio  movie_facebook_likes
0                      False       False         False                 False
1                      False       False         False                 False
2                      False       False         False                 False
3                      False       False         False                 False
4                      False       False          True                 False
...                      ...         ...           ...                   ...
5038                   False       False          True                 False
5039                   False       False         False                 False
5040                   False       False          True                 False
5041                   False       False         False                 False
5042                   False       False         False                 False

[5043 rows x 28 columns]

In [4]:
print(df.notnull()) #Gives the data as False if it finds an null or NaN value in the dataset else gives the data as True

      color  director_name  num_critic_for_reviews  duration  \
0      True           True                    True      True
1      True           True                    True      True
2      True           True                    True      True
3      True           True                    True      True
4     False           True                   False     False
...     ...            ...                     ...       ...
5038   True           True                    True      True
5039   True          False                    True      True
5040   True           True                    True      True
5041   True           True                    True      True
5042   True           True                    True      True

      director_facebook_likes  actor_3_facebook_likes  actor_2_name  \
0                        True                    True          True
1                        True                    True          True
2                        True                    True          True
3                        True                    True          True
4                        True                   False          True
...                       ...                     ...           ...
5038                     True                    True          True
5039                    False                    True          True
5040                     True                    True          True
5041                     True                    True          True
5042                     True                    True          True

      actor_1_facebook_likes  gross  genres  ...  num_user_for_reviews  \
0                       True   True    True  ...                  True
1                       True   True    True  ...                  True
2                       True   True    True  ...                  True
3                       True   True    True  ...                  True
4                       True  False    True  ...                 False
...                      ...    ...     ...  ...                   ...
5038                    True  False    True  ...                  True
5039                    True  False    True  ...                  True
5040                    True  False    True  ...                  True
5041                    True   True    True  ...                  True
5042                    True   True    True  ...                  True

      language  country  content_rating  budget  title_year  \
0         True     True            True    True        True
1         True     True            True    True        True
2         True     True            True    True        True
3         True     True            True    True        True
4        False    False           False   False       False
...        ...      ...             ...     ...         ...
5038      True     True           False   False        True
5039      True     True            True   False       False
5040      True     True           False    True        True
5041      True     True            True   False        True
5042      True     True            True    True        True

      actor_2_facebook_likes  imdb_score  aspect_ratio  movie_facebook_likes
0                       True        True          True                  True
1                       True        True          True                  True
2                       True        True          True                  True
3                       True        True          True                  True
4                       True        True         False                  True
...                      ...         ...           ...                   ...
5038                    True        True         False                  True
5039                    True        True          True                  True
5040                    True        True         False                  True
5041                    True        True          True                  True
5042                    True        True          True                  True

[5043 rows x 28 columns]

In [5]:
print(df.isnull().sum()) #Gives the count of null or NaN values for every column in the given dataset

color                         19
director_name                104
num_critic_for_reviews        50
duration                      15
director_facebook_likes      104
actor_3_facebook_likes        23
actor_2_name                  13
actor_1_facebook_likes         7
gross                        884
genres                         0
actor_1_name                   7
movie_title                    0
num_voted_users                0
cast_total_facebook_likes      0
actor_3_name                  23
facenumber_in_poster          13
plot_keywords                153
movie_imdb_link                0
num_user_for_reviews          21
language                      12
country                        5
content_rating               303
budget                       492
title_year                   108
actor_2_facebook_likes        13
imdb_score                     0
aspect_ratio                 329
movie_facebook_likes           0
dtype: int64

# Handling Missing values of categorical data

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/movie_metadata.csv")

In [3]:
print(df["country"].head()) #printing the first five rows in the column country

0    USA
1    USA
2     UK
3    USA
4    NaN
Name: country, dtype: object

In [4]:
print("NaN values before FillNA :",df["country"].isnull().sum())

NaN values before FillNA : 5

In [5]:
df.country=df.country.fillna("INDIA") #In the column country, it fills INDIA whereever it finds null or NaN value
print(df.country.head())

0      USA
1      USA
2       UK
3      USA
4    INDIA
Name: country, dtype: object

In [6]:
print("NaN values after FillNA :",df["country"].isnull().sum())

NaN values after FillNA : 0

In [7]:
df1=pd.read_csv("Data/movie_metadata.csv")

In [8]:
df1.country=df1.country.fillna(df1.country.mode()[0]) #Using .mode() function to fill the null value with highest frequency in the data set
print(df1.country.head())

0    USA
1    USA
2     UK
3    USA
4    USA
Name: country, dtype: object

In [9]:
df1["country"].fillna(df1["country"].mode()[0],inplace=True) #This is the standard procedure to fill null value and same as above procedure
print(df1.country.head())

0    USA
1    USA
2     UK
3    USA
4    USA
Name: country, dtype: object

In [10]:
print("NaN values after FillNA :",df1["country"].isnull().sum())

NaN values after FillNA : 0

# Handling Missing values of Numarical data

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/movie_metadata.csv")

In [3]:
print(df["duration"].head(15))

0     178.0
1     169.0
2     148.0
3     164.0
4       NaN
5     132.0
6     156.0
7     100.0
8     141.0
9     153.0
10    183.0
11    169.0
12    106.0
13    151.0
14    150.0
Name: duration, dtype: float64

In [4]:
print("NaN values before FillNA :",df["duration"].isnull().sum())

NaN values before FillNA : 15

In [5]:
print("Mean of duration :",df.duration.mean()) #Finding the mean of the column duration

Mean of duration : 107.2010739856802

In [6]:
print("Mean of duration :",round(df.duration.mean())) #round function gives the round figure for the number

Mean of duration : 107

In [7]:
print("Mean of duration :",round(df.duration.mean(),1)) #we can get required no.of fractional values by specifying them

Mean of duration : 107.2

In [8]:
df.duration=df.duration.fillna(round(df.duration.mean(),1)) ##Using .mode() function to fill the null value with highest frequency in the data set
print(df.duration.head(15))

0     178.0
1     169.0
2     148.0
3     164.0
4     107.2
5     132.0
6     156.0
7     100.0
8     141.0
9     153.0
10    183.0
11    169.0
12    106.0
13    151.0
14    150.0
Name: duration, dtype: float64

In [9]:
df["duration"].fillna(round(df["duration"].mean(),1),inplace=True) #This is the standard procedure to fill null value and same as above procedure
print(df.duration.head(15))

0     178.0
1     169.0
2     148.0
3     164.0
4     107.2
5     132.0
6     156.0
7     100.0
8     141.0
9     153.0
10    183.0
11    169.0
12    106.0
13    151.0
14    150.0
Name: duration, dtype: float64

In [10]:
print("NaN values after FillNA :",df["duration"].isnull().sum())

NaN values after FillNA : 0

# Handling Missing data in the entire dataset

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/stddatacsv.csv")
print(df)

   regno  name   phone address    m1  m2    m3    m4
0    101  anand    999     hyd  87.0  55   NaN  44.0
1    105    aaa    555     vij  77.0  66  99.0  99.0
2    109    rrr    444     vik   NaN  78  88.0  88.0
3    107    sss    888     sec  69.0  85  58.0   NaN
4    201  anand    999     hyd  87.0  55   NaN  44.0
5    202    aaa    555     vij   NaN  66  99.0   NaN
6    203    rrr    444     vik  89.0  78  88.0  88.0
7    204    NaN    888     NaN  33.0  77  58.0   NaN
8    205    bbb    111     ant  77.0  88  99.0  99.0

In [3]:
print(df.isnull().sum())

regno      0
name       1
phone      0
address    1
m1         2
m2         0
m3         2
m4         3
dtype: int64

In [4]:
df.m1.fillna(round(df.m1.mean()),inplace=True)
df.m3.fillna(round(df.m3.mean()),inplace=True)
df.m4.fillna(round(df.m4.mean()),inplace=True)
print("After filling nullvalues",df.isna().sum()) #Both .isna() and .isnull() are same

After filling nullvalues regno      0
name       1
phone      0
address    1
m1         0
m2         0
m3         0
m4         0
dtype: int64

In [5]:
df

   regno  name   phone address    m1  m2    m3    m4
0    101  anand    999     hyd  87.0  55  84.0  44.0
1    105    aaa    555     vij  77.0  66  99.0  99.0
2    109    rrr    444     vik  74.0  78  88.0  88.0
3    107    sss    888     sec  69.0  85  58.0  77.0
4    201  anand    999     hyd  87.0  55  84.0  44.0
5    202    aaa    555     vij  74.0  66  99.0  77.0
6    203    rrr    444     vik  89.0  78  88.0  88.0
7    204    NaN    888     NaN  33.0  77  58.0  77.0
8    205    bbb    111     ant  77.0  88  99.0  99.0

In [6]:
df1=pd.read_csv("Data/stddatacsv.csv")

In [7]:
print("Before dropna() function :\n",df1) #Actual data

Before dropna() function :
    regno  name   phone address    m1  m2    m3    m4
0    101  anand    999     hyd  87.0  55   NaN  44.0
1    105    aaa    555     vij  77.0  66  99.0  99.0
2    109    rrr    444     vik   NaN  78  88.0  88.0
3    107    sss    888     sec  69.0  85  58.0   NaN
4    201  anand    999     hyd  87.0  55   NaN  44.0
5    202    aaa    555     vij   NaN  66  99.0   NaN
6    203    rrr    444     vik  89.0  78  88.0  88.0
7    204    NaN    888     NaN  33.0  77  58.0   NaN
8    205    bbb    111     ant  77.0  88  99.0  99.0

In [8]:
dt=df1.dropna() #Drop the rows which contains null or nan values

In [9]:
print(dt)

   regno name   phone address    m1  m2    m3    m4
1    105   aaa    555     vij  77.0  66  99.0  99.0
6    203   rrr    444     vik  89.0  78  88.0  88.0
8    205   bbb    111     ant  77.0  88  99.0  99.0

In [10]:
dt=dt.reset_index() #Re-assign the index values and consider the old indexing as another column

In [11]:
print("After dropna() function and re-assigning index values :\n",dt)

After dropna() function and re-assigning index values :
    index  regno name   phone address    m1  m2    m3    m4
0      1    105   aaa    555     vij  77.0  66  99.0  99.0
1      6    203   rrr    444     vik  89.0  78  88.0  88.0
2      8    205   bbb    111     ant  77.0  88  99.0  99.0

In [22]:
df2=pd.read_csv("Data/stddatacsv.csv") #Dataset having empty rows
print(df2)

    regno  name   phone address    m1    m2    m3    m4
0   101.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
1   105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
2     NaN    NaN    NaN     NaN   NaN   NaN   NaN   NaN
3   109.0    rrr  444.0     vik   NaN  78.0  88.0  88.0
4   107.0    sss  888.0     sec  69.0  85.0  58.0   NaN
5     NaN    NaN    NaN     NaN   NaN   NaN   NaN   NaN
6   201.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
7   202.0    aaa  555.0     vij   NaN  66.0  99.0   NaN
8   203.0    rrr  444.0     vik  89.0  78.0  88.0  88.0
9     NaN    NaN    NaN     NaN   NaN   NaN   NaN   NaN
10  204.0    NaN  888.0     NaN  33.0  77.0  58.0   NaN
11  205.0    bbb  111.0     ant  77.0  88.0  99.0  99.0

In [23]:
dt=df2.dropna(how="all") #Drop the rows having all null or nan values

In [24]:
print("Dropna() function with How=all :\n",dt)

Dropna() function with How=all :
     regno  name   phone address    m1    m2    m3    m4
0   101.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
1   105.0    aaa  555.0     vij  77.0  66.0  99.0  99.0
3   109.0    rrr  444.0     vik   NaN  78.0  88.0  88.0
4   107.0    sss  888.0     sec  69.0  85.0  58.0   NaN
6   201.0  anand  999.0     hyd  87.0  55.0   NaN  44.0
7   202.0    aaa  555.0     vij   NaN  66.0  99.0   NaN
8   203.0    rrr  444.0     vik  89.0  78.0  88.0  88.0
10  204.0    NaN  888.0     NaN  33.0  77.0  58.0   NaN
11  205.0    bbb  111.0     ant  77.0  88.0  99.0  99.0

In [25]:
df3=pd.read_csv("Data/stddatacsv.csv") #Dataset having repeated rows or duplicates
print(df3)

    regno  name   phone address    m1  m2    m3    m4
0     101  anand    999     hyd  87.0  55   NaN  44.0
1     105    aaa    555     vij  77.0  66  99.0  99.0
2     109    rrr    444     vik   NaN  78  88.0  88.0
3     107    sss    888     sec  69.0  85  58.0   NaN
4     201  anand    999     hyd  87.0  55   NaN  44.0
5     201  anand    999     hyd  87.0  55   NaN  44.0
6     202    aaa    555     vij   NaN  66  99.0   NaN
7     203    rrr    444     vik  89.0  78  88.0  88.0
8     204    NaN    888     NaN  33.0  77  58.0   NaN
9     205    bbb    111     ant  77.0  88  99.0  99.0
10    205    bbb    111     ant  77.0  88  99.0  99.0

In [26]:
print("Droping duplicate records :\n",df3.drop_duplicates()) #Drops the repeated rows or duplicates

Droping duplicate records :
    regno  name   phone address    m1  m2    m3    m4
0    101  anand    999     hyd  87.0  55   NaN  44.0
1    105    aaa    555     vij  77.0  66  99.0  99.0
2    109    rrr    444     vik   NaN  78  88.0  88.0
3    107    sss    888     sec  69.0  85  58.0   NaN
4    201  anand    999     hyd  87.0  55   NaN  44.0
6    202    aaa    555     vij   NaN  66  99.0   NaN
7    203    rrr    444     vik  89.0  78  88.0  88.0
8    204    NaN    888     NaN  33.0  77  58.0   NaN
9    205    bbb    111     ant  77.0  88  99.0  99.0

In [27]:
df4=pd.read_csv("Data/stddatacsv.csv") #Actual dataset

In [28]:
print(df4.dropna(thresh=6)) #Drops the row if it contains less than 6 values since we are giving thresh = 6

   regno  name   phone address    m1  m2    m3    m4
0    101  anand    999     hyd  87.0  55   NaN  44.0
1    105    aaa    555     vij  77.0  66  99.0  99.0
2    109    rrr    444     vik   NaN  78  88.0  88.0
3    107    sss    888     sec  69.0  85  58.0   NaN
4    201  anand    999     hyd  87.0  55   NaN  44.0
5    202    aaa    555     vij   NaN  66  99.0   NaN
6    203    rrr    444     vik  89.0  78  88.0  88.0
8    205    bbb    111     ant  77.0  88  99.0  99.0

In [29]:
print(df4.dropna(subset=["m3"])) #Drops the rows containing null oe nan values with respect to column m3

   regno name   phone address    m1  m2    m3    m4
1    105   aaa    555     vij  77.0  66  99.0  99.0
2    109   rrr    444     vik   NaN  78  88.0  88.0
3    107   sss    888     sec  69.0  85  58.0   NaN
5    202   aaa    555     vij   NaN  66  99.0   NaN
6    203   rrr    444     vik  89.0  78  88.0  88.0
7    204   NaN    888     NaN  33.0  77  58.0   NaN
8    205   bbb    111     ant  77.0  88  99.0  99.0

In [30]:
print(df4.dropna(subset=["m3","m4"])) #Drops the rows containing null oe nan values with respect to columns m3 and m4

   regno name   phone address    m1  m2    m3    m4
1    105   aaa    555     vij  77.0  66  99.0  99.0
2    109   rrr    444     vik   NaN  78  88.0  88.0
6    203   rrr    444     vik  89.0  78  88.0  88.0
8    205   bbb    111     ant  77.0  88  99.0  99.0

In [32]:
df5=pd.read_csv("Data/stddatacsv.csv") #Dataset containing empty column
print(df5)

   regno  name   father's name  phone address    m1  m2    m3    m4
0    101  anand            NaN    999     hyd  87.0  55   NaN  44.0
1    105    aaa            NaN    555     vij  77.0  66  99.0  99.0
2    109    rrr            NaN    444     vik   NaN  78  88.0  88.0
3    107    sss            NaN    888     sec  69.0  85  58.0   NaN
4    201  anand            NaN    999     hyd  87.0  55   NaN  44.0
5    202    aaa            NaN    555     vij   NaN  66  99.0   NaN
6    203    rrr            NaN    444     vik  89.0  78  88.0  88.0
7    204    NaN            NaN    888     NaN  33.0  77  58.0   NaN
8    205    bbb            NaN    111     ant  77.0  88  99.0  99.0

In [34]:
print(df5.dropna(axis=1,how="all")) #Drops the empty column in the dataset and axis = 1 represents columns and axis = 0 represents rows and if we didn't specify axis by default it will consider rows

   regno  name   phone address    m1  m2    m3    m4
0    101  anand    999     hyd  87.0  55   NaN  44.0
1    105    aaa    555     vij  77.0  66  99.0  99.0
2    109    rrr    444     vik   NaN  78  88.0  88.0
3    107    sss    888     sec  69.0  85  58.0   NaN
4    201  anand    999     hyd  87.0  55   NaN  44.0
5    202    aaa    555     vij   NaN  66  99.0   NaN
6    203    rrr    444     vik  89.0  78  88.0  88.0
7    204    NaN    888     NaN  33.0  77  58.0   NaN
8    205    bbb    111     ant  77.0  88  99.0  99.0

In [35]:
print(df5.dropna(axis=1)) #If we didnt specify how = "all" it will not only drops empty columns but also drops the columns having atleast one null or nan value

   regno  phone  m2
0    101    999  55
1    105    555  66
2    109    444  78
3    107    888  85
4    201    999  55
5    202    555  66
6    203    444  78
7    204    888  77
8    205    111  88

In [36]:
print(df5.dropna(axis=1,thresh=8)) #Drops the columns if it contains less than 8 values since we are giving thresh = 8

   regno  name   phone address  m2
0    101  anand    999     hyd  55
1    105    aaa    555     vij  66
2    109    rrr    444     vik  78
3    107    sss    888     sec  85
4    201  anand    999     hyd  55
5    202    aaa    555     vij  66
6    203    rrr    444     vik  78
7    204    NaN    888     NaN  77
8    205    bbb    111     ant  88

In [2]:
DF=pd.read_csv("Data/movie_metadata.csv")
print(DF.head())

   color      director_name  num_critic_for_reviews  duration  \
0  Color      James Cameron                   723.0     178.0
1  Color     Gore Verbinski                   302.0     169.0
2  Color         Sam Mendes                   602.0     148.0
3  Color  Christopher Nolan                   813.0     164.0
4    NaN        Doug Walker                     NaN       NaN

   director_facebook_likes  actor_3_facebook_likes      actor_2_name  \
0                      0.0                   855.0  Joel David Moore
1                    563.0                  1000.0     Orlando Bloom
2                      0.0                   161.0      Rory Kinnear
3                  22000.0                 23000.0    Christian Bale
4                    131.0                     NaN        Rob Walker

   actor_1_facebook_likes        gross                           genres  ...  \
0                  1000.0  760505847.0  Action|Adventure|Fantasy|Sci-Fi  ...
1                 40000.0  309404152.0         Action|Adventure|Fantasy  ...
2                 11000.0  200074175.0        Action|Adventure|Thriller  ...
3                 27000.0  448130642.0                  Action|Thriller  ...
4                   131.0          NaN                      Documentary  ...

  num_user_for_reviews language  country  content_rating       budget  \
0               3054.0  English      USA           PG-13  237000000.0
1               1238.0  English      USA           PG-13  300000000.0
2                994.0  English       UK           PG-13  245000000.0
3               2701.0  English      USA           PG-13  250000000.0
4                  NaN      NaN      NaN             NaN          NaN

   title_year actor_2_facebook_likes imdb_score  aspect_ratio  \
0      2009.0                  936.0        7.9          1.78
1      2007.0                 5000.0        7.1          2.35
2      2015.0                  393.0        6.8          2.35
3      2012.0                23000.0        8.5          2.35
4         NaN                   12.0        7.1           NaN

  movie_facebook_likes
0                33000
1                    0
2                85000
3               164000
4                    0

[5 rows x 28 columns]

In [3]:
DF["director_name"] = DF["director_name"].str.upper() #Converts letters to upper case

In [4]:
print(DF.head(10))

   color      director_name  num_critic_for_reviews  duration  \
0  Color      JAMES CAMERON                   723.0     178.0
1  Color     GORE VERBINSKI                   302.0     169.0
2  Color         SAM MENDES                   602.0     148.0
3  Color  CHRISTOPHER NOLAN                   813.0     164.0
4    NaN        DOUG WALKER                     NaN       NaN
5  Color     ANDREW STANTON                   462.0     132.0
6  Color          SAM RAIMI                   392.0     156.0
7  Color       NATHAN GRENO                   324.0     100.0
8  Color        JOSS WHEDON                   635.0     141.0
9  Color        DAVID YATES                   375.0     153.0

   director_facebook_likes  actor_3_facebook_likes       actor_2_name  \
0                      0.0                   855.0   Joel David Moore
1                    563.0                  1000.0      Orlando Bloom
2                      0.0                   161.0       Rory Kinnear
3                  22000.0                 23000.0     Christian Bale
4                    131.0                     NaN         Rob Walker
5                    475.0                   530.0    Samantha Morton
6                      0.0                  4000.0       James Franco
7                     15.0                   284.0       Donna Murphy
8                      0.0                 19000.0  Robert Downey Jr.
9                    282.0                 10000.0   Daniel Radcliffe

   actor_1_facebook_likes        gross  \
0                  1000.0  760505847.0
1                 40000.0  309404152.0
2                 11000.0  200074175.0
3                 27000.0  448130642.0
4                   131.0          NaN
5                   640.0   73058679.0
6                 24000.0  336530303.0
7                   799.0  200807262.0
8                 26000.0  458991599.0
9                 25000.0  301956980.0

                                              genres  ...  \
0                    Action|Adventure|Fantasy|Sci-Fi  ...
1                           Action|Adventure|Fantasy  ...
2                          Action|Adventure|Thriller  ...
3                                    Action|Thriller  ...
4                                        Documentary  ...
5                            Action|Adventure|Sci-Fi  ...
6                           Action|Adventure|Romance  ...
7  Adventure|Animation|Comedy|Family|Fantasy|Musi...  ...
8                            Action|Adventure|Sci-Fi  ...
9                   Adventure|Family|Fantasy|Mystery  ...

  num_user_for_reviews language  country  content_rating       budget  \
0               3054.0  English      USA           PG-13  237000000.0
1               1238.0  English      USA           PG-13  300000000.0
2                994.0  English       UK           PG-13  245000000.0
3               2701.0  English      USA           PG-13  250000000.0
4                  NaN      NaN      NaN             NaN          NaN
5                738.0  English      USA           PG-13  263700000.0
6               1902.0  English      USA           PG-13  258000000.0
7                387.0  English      USA              PG  260000000.0
8               1117.0  English      USA           PG-13  250000000.0
9                973.0  English       UK              PG  250000000.0

   title_year actor_2_facebook_likes imdb_score  aspect_ratio  \
0      2009.0                  936.0        7.9          1.78
1      2007.0                 5000.0        7.1          2.35
2      2015.0                  393.0        6.8          2.35
3      2012.0                23000.0        8.5          2.35
4         NaN                   12.0        7.1           NaN
5      2012.0                  632.0        6.6          2.35
6      2007.0                11000.0        6.2          2.35
7      2010.0                  553.0        7.8          1.85
8      2015.0                21000.0        7.5          2.35
9      2009.0                11000.0        7.5          2.35

  movie_facebook_likes
0                33000
1                    0
2                85000
3               164000
4                    0
5                24000
6                    0
7                29000
8               118000
9                10000

[10 rows x 28 columns]

In [5]:
print(DF["movie_title"].str.strip()) #Remove white spaces

0                                           Avatar
1         Pirates of the Caribbean: At World's End
2                                          Spectre
3                            The Dark Knight Rises
4       Star Wars: Episode VII - The Force Awakens
                           ...
5038                       Signed Sealed Delivered
5039                                 The Following
5040                          A Plague So Pleasant
5041                              Shanghai Calling
5042                             My Date with Drew
Name: movie_title, Length: 5043, dtype: object

In [6]:
dfnew=DF.rename(columns={"director_name":"director","movie_facebook_likes":"facebook_likes"})

In [7]:
print(dfnew.head())

   color           director  num_critic_for_reviews  duration  \
0  Color      JAMES CAMERON                   723.0     178.0
1  Color     GORE VERBINSKI                   302.0     169.0
2  Color         SAM MENDES                   602.0     148.0
3  Color  CHRISTOPHER NOLAN                   813.0     164.0
4    NaN        DOUG WALKER                     NaN       NaN

   director_facebook_likes  actor_3_facebook_likes      actor_2_name  \
0                      0.0                   855.0  Joel David Moore
1                    563.0                  1000.0     Orlando Bloom
2                      0.0                   161.0      Rory Kinnear
3                  22000.0                 23000.0    Christian Bale
4                    131.0                     NaN        Rob Walker

   actor_1_facebook_likes        gross                           genres  ...  \
0                  1000.0  760505847.0  Action|Adventure|Fantasy|Sci-Fi  ...
1                 40000.0  309404152.0         Action|Adventure|Fantasy  ...
2                 11000.0  200074175.0        Action|Adventure|Thriller  ...
3                 27000.0  448130642.0                  Action|Thriller  ...
4                   131.0          NaN                      Documentary  ...

  num_user_for_reviews language  country  content_rating       budget  \
0               3054.0  English      USA           PG-13  237000000.0
1               1238.0  English      USA           PG-13  300000000.0
2                994.0  English       UK           PG-13  245000000.0
3               2701.0  English      USA           PG-13  250000000.0
4                  NaN      NaN      NaN             NaN          NaN

   title_year actor_2_facebook_likes imdb_score  aspect_ratio facebook_likes
0      2009.0                  936.0        7.9          1.78          33000
1      2007.0                 5000.0        7.1          2.35              0
2      2015.0                  393.0        6.8          2.35          85000
3      2012.0                23000.0        8.5          2.35         164000
4         NaN                   12.0        7.1           NaN              0

[5 rows x 28 columns]

In [8]:
dfnew.to_csv("newfilefeb.csv")

# Handling the missing data and saving it in a new file

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/Admission_Prediction.csv")

In [3]:
print(df.head())

   Serial No.  GRE Score  TOEFL Score  University Rating  SOP  LOR  CGPA  \
0           1      337.0        118.0                4.0  4.5  4.5  9.65
1           2      324.0        107.0                4.0  4.0  4.5  8.87
2           3        NaN        104.0                3.0  3.0  3.5  8.00
3           4      322.0        110.0                3.0  3.5  2.5  8.67
4           5      314.0        103.0                2.0  2.0  3.0  8.21

   Research  Chance of Admit
0         1             0.92
1         1             0.76
2         1             0.72
3         1             0.80
4         0             0.65

In [5]:
print(df.shape)

(500, 9)

In [7]:
print(df.columns)

Index(['Serial No.', 'GRE Score', 'TOEFL Score', 'University Rating', 'SOP',
       'LOR', 'CGPA', 'Research', 'Chance of Admit'],
      dtype='object')

In [8]:
print(df.dtypes)

Serial No.             int64
GRE Score            float64
TOEFL Score          float64
University Rating    float64
SOP                  float64
LOR                  float64
CGPA                 float64
Research               int64
Chance of Admit      float64
dtype: object

In [9]:
print(df.describe())

       Serial No.   GRE Score  TOEFL Score  University Rating         SOP  \
count  500.000000  485.000000   490.000000         485.000000  500.000000
mean   250.500000  316.558763   107.187755           3.121649    3.374000
std    144.481833   11.274704     6.112899           1.146160    0.991004
min      1.000000  290.000000    92.000000           1.000000    1.000000
25%    125.750000  308.000000   103.000000           2.000000    2.500000
50%    250.500000  317.000000   107.000000           3.000000    3.500000
75%    375.250000  325.000000   112.000000           4.000000    4.000000
max    500.000000  340.000000   120.000000           5.000000    5.000000

             LOR        CGPA    Research  Chance of Admit
count  500.00000  500.000000  500.000000        500.00000
mean     3.48400    8.576440    0.560000          0.72174
std      0.92545    0.604813    0.496884          0.14114
min      1.00000    6.800000    0.000000          0.34000
25%      3.00000    8.127500    0.000000          0.63000
50%      3.50000    8.560000    1.000000          0.72000
75%      4.00000    9.040000    1.000000          0.82000
max      5.00000    9.920000    1.000000          0.97000

In [10]:
print(df.describe().T) #Here T means Transpose

                   count        mean         std     min       25%     50%  \
Serial No.         500.0  250.500000  144.481833    1.00  125.7500  250.50
GRE Score          485.0  316.558763   11.274704  290.00  308.0000  317.00
TOEFL Score        490.0  107.187755    6.112899   92.00  103.0000  107.00
University Rating  485.0    3.121649    1.146160    1.00    2.0000    3.00
SOP                500.0    3.374000    0.991004    1.00    2.5000    3.50
LOR                500.0    3.484000    0.925450    1.00    3.0000    3.50
CGPA               500.0    8.576440    0.604813    6.80    8.1275    8.56
Research           500.0    0.560000    0.496884    0.00    0.0000    1.00
Chance of Admit    500.0    0.721740    0.141140    0.34    0.6300    0.72

                      75%     max
Serial No.         375.25  500.00
GRE Score          325.00  340.00
TOEFL Score        112.00  120.00
University Rating    4.00    5.00
SOP                  4.00    5.00
LOR                  4.00    5.00
CGPA                 9.04    9.92
Research             1.00    1.00
Chance of Admit      0.82    0.97

In [11]:
print("NaN values list before cleaning :\n",df.isna().sum())

NaN values list before cleaning :
 Serial No.            0
GRE Score            15
TOEFL Score          10
University Rating    15
SOP                   0
LOR                   0
CGPA                  0
Research              0
Chance of Admit       0
dtype: int64

#As we can see, there are some column with missing values. We need to impute those missing values

In [12]:
df["GRE Score"].fillna(round(df["GRE Score"].mean()),inplace=True)
df["TOEFL Score"].fillna(round(df["TOEFL Score"].mean()),inplace=True)
df["University Rating"].fillna(df["University Rating"].mode()[0],inplace=True)
print("NaN Values list after cleaning :\n",df.isnull().sum())

NaN Values list after cleaning :
 Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

In [13]:
df.to_csv("admissing_prediction_cleaned.csv")

# Data sorting

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/movie_metadata.csv")
print(df)

      color      director_name  num_critic_for_reviews  duration  \
0     Color      James Cameron                   723.0     178.0
1     Color     Gore Verbinski                   302.0     169.0
2     Color         Sam Mendes                   602.0     148.0
3     Color  Christopher Nolan                   813.0     164.0
4       NaN        Doug Walker                     NaN       NaN
...     ...                ...                     ...       ...
5038  Color        Scott Smith                     1.0      87.0
5039  Color                NaN                    43.0      43.0
5040  Color   Benjamin Roberds                    13.0      76.0
5041  Color        Daniel Hsia                    14.0     100.0
5042  Color           Jon Gunn                    43.0      90.0

      director_facebook_likes  actor_3_facebook_likes      actor_2_name  \
0                         0.0                   855.0  Joel David Moore
1                       563.0                  1000.0     Orlando Bloom
2                         0.0                   161.0      Rory Kinnear
3                     22000.0                 23000.0    Christian Bale
4                       131.0                     NaN        Rob Walker
...                       ...                     ...               ...
5038                      2.0                   318.0     Daphne Zuniga
5039                      NaN                   319.0     Valorie Curry
5040                      0.0                     0.0     Maxwell Moody
5041                      0.0                   489.0     Daniel Henney
5042                     16.0                    16.0  Brian Herzlinger

      actor_1_facebook_likes        gross                           genres  \
0                     1000.0  760505847.0  Action|Adventure|Fantasy|Sci-Fi
1                    40000.0  309404152.0         Action|Adventure|Fantasy
2                    11000.0  200074175.0        Action|Adventure|Thriller
3                    27000.0  448130642.0                  Action|Thriller
4                      131.0          NaN                      Documentary
...                      ...          ...                              ...
5038                   637.0          NaN                     Comedy|Drama
5039                   841.0          NaN     Crime|Drama|Mystery|Thriller
5040                     0.0          NaN            Drama|Horror|Thriller
5041                   946.0      10443.0             Comedy|Drama|Romance
5042                    86.0      85222.0                      Documentary

      ... num_user_for_reviews language  country  content_rating       budget  \
0     ...               3054.0  English      USA           PG-13  237000000.0
1     ...               1238.0  English      USA           PG-13  300000000.0
2     ...                994.0  English       UK           PG-13  245000000.0
3     ...               2701.0  English      USA           PG-13  250000000.0
4     ...                  NaN      NaN      NaN             NaN          NaN
...   ...                  ...      ...      ...             ...          ...
5038  ...                  6.0  English   Canada             NaN          NaN
5039  ...                359.0  English      USA           TV-14          NaN
5040  ...                  3.0  English      USA             NaN       1400.0
5041  ...                  9.0  English      USA           PG-13          NaN
5042  ...                 84.0  English      USA              PG       1100.0

      title_year actor_2_facebook_likes imdb_score  aspect_ratio  \
0         2009.0                  936.0        7.9          1.78
1         2007.0                 5000.0        7.1          2.35
2         2015.0                  393.0        6.8          2.35
3         2012.0                23000.0        8.5          2.35
4            NaN                   12.0        7.1           NaN
...          ...                    ...        ...           ...
5038      2013.0                  470.0        7.7           NaN
5039         NaN                  593.0        7.5         16.00
5040      2013.0                    0.0        6.3           NaN
5041      2012.0                  719.0        6.3          2.35
5042      2004.0                   23.0        6.6          1.85

     movie_facebook_likes
0                   33000
1                       0
2                   85000
3                  164000
4                       0
...                   ...
5038                   84
5039                32000
5040                   16
5041                  660
5042                  456

[5043 rows x 28 columns]

In [3]:
print(df["duration"].head(10))

0    178.0
1    169.0
2    148.0
3    164.0
4      NaN
5    132.0
6    156.0
7    100.0
8    141.0
9    153.0
Name: duration, dtype: float64

In [4]:
dt=df.sort_values("duration")
print(dt)

      color     director_name  num_critic_for_reviews  duration  \
2345  Color        Jane Clark                     NaN       7.0
1947  Color               NaN                    12.0       7.0
4079  Color               NaN                    38.0      11.0
4673  Color       Clark Baker                     1.0      14.0
4439  Color  Robert Greenwald                    56.0      20.0
...     ...               ...                     ...       ...
4517  Color               NaN                     2.0       NaN
4609  Color      Wajahat Rauf                     6.0       NaN
4690  Color   Joseph Kosinski                     4.0       NaN
4948  Color         Valentine                     NaN       NaN
4989  Color    Daniel Mellitz                     NaN       NaN

      director_facebook_likes  actor_3_facebook_likes        actor_2_name  \
2345                     23.0                    51.0     Traci Dinwiddie
1947                      NaN                     3.0        John Sparkes
4079                      NaN                     0.0          Seth Green
4673                      0.0                    37.0  Alan Pietruszewski
4439                     21.0                     0.0          Jon Hunter
...                       ...                     ...                 ...
4517                      NaN                   206.0        John Jarratt
4609                      3.0                     4.0         Ayesha Omar
4690                    364.0                   567.0        Lauren Cohan
4948                      0.0                     NaN           Valentine
4989                      0.0                    15.0        Chelse Swain

      actor_1_facebook_likes  gross                           genres  ...  \
2345                   344.0    NaN                    Romance|Short  ...
1947                    45.0    NaN          Animation|Comedy|Family  ...
4079                    11.0    NaN                 Animation|Comedy  ...
4673                   134.0    NaN     Horror|Sci-Fi|Short|Thriller  ...
4439                     0.0    NaN                      Documentary  ...
...                      ...    ...                              ...  ...
4517                   511.0    NaN            Drama|Horror|Thriller  ...
4609                     7.0    NaN                    Comedy|Family  ...
4690                 22000.0    NaN  Action|Adventure|Fantasy|Sci-Fi  ...
4948                    17.0    NaN                          Romance  ...
4989                  1000.0    NaN                     Comedy|Drama  ...

     num_user_for_reviews language    country  content_rating     budget  \
2345                  NaN  English        USA             NaN    13000.0
1947                 12.0  English         UK            TV-G        NaN
4079                 75.0  English        USA           TV-MA        NaN
4673                  3.0  English        USA             NaN        NaN
4439                 70.0  English        USA       Not Rated  1500000.0
...                   ...      ...        ...             ...        ...
4517                  6.0  English  Australia             NaN        NaN
4609                 15.0     Urdu   Pakistan             NaN  1000000.0
4690                 11.0  English        USA             NaN        NaN
4948                  NaN  English        USA           PG-13   125000.0
4989                  3.0  English        USA             NaN        NaN

      title_year actor_2_facebook_likes imdb_score  aspect_ratio  \
2345      2007.0                  281.0        5.2          1.85
1947         NaN                    7.0        8.3           NaN
4079         NaN                    0.0        7.8          1.33
4673      2012.0                   93.0        6.2           NaN
4439      2005.0                    0.0        6.8          1.85
...          ...                    ...        ...           ...
4517         NaN                  457.0        7.1          2.00
4609      2015.0                    5.0        7.0           NaN
4690      2014.0                 4000.0        8.1           NaN
4948      2015.0                    0.0        5.1           NaN
4989      2006.0                   36.0        4.7           NaN

     movie_facebook_likes
2345                   30
1947                  834
4079                 1000
4673                   14
4439                    0
...                   ...
4517                  954
4609                  259
4690                 1000
4948                    0
4989                    2

[5043 rows x 28 columns]

In [5]:
print(dt.duration.head(10))

2345     7.0
1947     7.0
4079    11.0
4673    14.0
4439    20.0
4803    22.0
757     22.0
816     22.0
833     22.0
4281    22.0
Name: duration, dtype: float64

In [6]:
DA=df.sort_values("duration",ascending = False) #Now the values in the column duration will be printed in descending order
print(DA.duration.head(10))

1710    511.0
2466    334.0
1501    330.0
1144    325.0
3311    300.0
2970    293.0
1571    289.0
2727    286.0
883     280.0
1980    271.0
Name: duration, dtype: float64

# Find the mean of Departure delays for every origin

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Data/flightdata.csv")

In [3]:
print(df.head())

      FL_DATE OP_UNIQUE_CARRIER  OP_CARRIER_FL_NUM ORIGIN DEST  DEP_DELAY  \
0  2019-01-01                9E               5246    MSP  MKE       33.0
1  2019-01-01                9E               5249    ATL  PHF        8.0
2  2019-01-01                9E               5249    PHF  ATL       -6.0
3  2019-01-01                9E               5250    MSP  CLE       10.0
4  2019-01-01                9E               5254    MSP  RDU       -5.0

   ARR_DELAY  CANCELLED  ACTUAL_ELAPSED_TIME  CARRIER_DELAY  WEATHER_DELAY  \
0        8.0        0.0                 64.0            NaN            NaN
1       -5.0        0.0                 90.0            NaN            NaN
2       -2.0        0.0                121.0            NaN            NaN
3       -5.0        0.0                102.0            NaN            NaN
4      -27.0        0.0                139.0            NaN            NaN

   NAS_DELAY  SECURITY_DELAY  LATE_AIRCRAFT_DELAY  Unnamed: 14
0        NaN             NaN                  NaN          NaN
1        NaN             NaN                  NaN          NaN
2        NaN             NaN                  NaN          NaN
3        NaN             NaN                  NaN          NaN
4        NaN             NaN                  NaN          NaN

In [4]:
print(df.shape)

(583985, 15)

In [5]:
print(df.groupby(["ORIGIN"])["DEP_DELAY"].mean())

ORIGIN
ABE    12.208723
ABI     5.428571
ABQ     3.961062
ABR     9.983333
ABY     2.783133
         ...
VPS     3.480573
WRG    11.913793
XNA     9.654492
YAK    -1.218182
YUM    -0.756522
Name: DEP_DELAY, Length: 346, dtype: float64

In [6]:
print(df.groupby(["ORIGIN"],sort=False)["DEP_DELAY"].max())

ORIGIN
MSP    1266.0
ATL    1434.0
PHF     193.0
RIC    1042.0
OMA    1245.0
        ...
SMX     139.0
OGS     268.0
PPG      13.0
OGD      91.0
LYH      34.0
Name: DEP_DELAY, Length: 346, dtype: float64

In [7]:
dt=df.groupby(["ORIGIN"],sort=False)["DEP_DELAY"].mean() #To fetch the one origin details

In [8]:
print("DEP_DELAY from ATL :",round(dt["ATL"],2))

DEP_DELAY from ATL : 5.76